{
  "fantasy": {
    "squat": {
      "perfect": "위대한 용사여, 기사의 하체 단련 훈련을 완벽하게 마스터했으니 그대의 다리는 강철처럼 단단해졌소. 이제 그 힘으로 전설의 검에 깃든 마력을 더욱 증폭시켜, 다가올 어둠을 물리치시오!",
      "good": "굳건해진 다리로 일어서는 그대, 기사. 하체 단련 훈련의 성과가 느껴지는가? 현자의 가르침과 그대의 노력이 결실을 맺어, 곧 새로운 검술을 연마할 수 있게 되리라.",
      "normal": "새로운 힘이 느껴지시나요, 용사님? 기사의 하체 단련 훈련을 통해 한층 더 강인해진 다리는 앞으로 나아갈 용기를 북돋아 줄 것입니다. 이제 더 많은 경험치를 얻고, 더욱 강력한 몬스터에 도전하세요!"
    },
    "bridge": {
      "perfect": "마나의 흐름이 용사님의 심장을 따라 굽이치며, 대지의 기운을 완벽히 충전하는 데 성공했습니다. 영웅의 위대한 업적은 왕국을 수호하는 빛이 되어, 곧 더욱 강력한 마법 장비로 발현될 것입니다. 이제, 새로운 힘을 손에 넣은 용사여, 다음 시련을 향해 나아가십시오!",
      "good": "마나의 흐름이 몸 안에서 더욱 굳건해지는 것을 느꼈습니다. 브릿지 수련을 통해 얻은 힘으로, 다음 시험에서 새로운 검술을 펼칠 수 있을 겁니다. 현자의 가르침을 따라 더욱 정진하십시오.",
      "normal": "따스한 기운이 온몸을 감싸는 듯합니다. 브릿지 자세를 통해 마법 에너지를 충전하는 데 성공하셨군요! 이제 더 많은 경험치를 얻어 더욱 강력한 모험가가 될 수 있을 겁니다."
    },
    "dead_bug": {
      "perfect": "고대 전사의 코어 강화 비법을 완벽히 터득한 용사여, 그대의 투지에 왕국 전체가 감탄하고 있다! 이제 그대의 영웅담에 새로운 장이 쓰여질 것이며, 마법 장비는 더욱 강력한 힘을 발휘할 것이다. 다음 시련을 향해 나아가라!",
      "good": "\"고대 전사의 코어 강화 비법\" 수련을 마치니, 몸 안에 잠재된 힘이 깨어나는 듯합니다. 그대의 기운이 더욱 강건해졌으니, 이제 새로운 검술을 익힐 준비가 되었소. 현자의 가르침을 따라 다음 여정으로 나아가시오.",
      "normal": "따뜻한 기운이 몸 안에서 솟아오르는 듯합니다. 고대 전사의 비법을 익히며 한층 더 강인해진 당신, 이제 더 험난한 모험도 헤쳐나갈 수 있을 거예요."
    },
    "bird_dog": {
      "perfect": "용사여, 레인저의 균형 훈련을 완벽하게 마스터했도다! 그대의 숙련된 기운은 대지를 진동시키고, 찬란한 빛으로 빛나는 갑옷은 더욱 견고해질 것이다. 이제 더욱 강력해진 힘으로, 왕국을 위협하는 어둠을 물리칠 준비를 하라.",
      "good": "\"레인저의 균형 훈련\"을 마치니, 몸 안에 잠재되었던 기운이 깨어나는 듯합니다. 굳건해진 기운을 바탕으로, 현자가 준비한 새로운 기술을 연마해 보세요. 더욱 강력한 기사가 될 당신의 앞날을 응원합니다.",
      "normal": "따뜻한 햇살 아래 레인저의 균형 훈련을 마친 용사여, 그대의 인내에 감탄하오. 작은 발걸음들이 모여 위대한 영웅을 만들 듯, 이 경험이 그대의 여정에 빛나는 이정표가 될 것이오. 더 큰 힘이 그대를 기다리고 있소."
    },
    "plank_hold": {
      "perfect": "불굴의 의지 수련을 완수한 용사여, 그대의 정신은 강철처럼 단단해졌소! 이제 그대의 검에 깃든 마력이 더욱 강력해져, 왕국을 수호하는 빛이 될 것이오. 다음 시련을 통해 더욱 위대한 영웅으로 거듭나시오.",
      "good": "\"불굴의 의지 수련\"을 통해 자네의 기사로서의 자질이 한층 더 굳건해졌네. 자, 이제 곧 새로운 기술을 연마하여 더욱 강대한 적에 맞설 준비를 해야 할 때가 왔네. 현자의 지혜와 마법사 동료의 도움을 받아 더욱 빛나는 기사가 되기를 바라네.",
      "normal": "\"불굴의 의지 수련\"을 끝낸 용사여, 그대의 인내심에 경의를 표한다. 작은 시작이지만, 그대의 여정은 이제 막 시작되었으니 희망을 잃지 마라. 앞으로 나아갈수록 더 많은 경험과 지혜를 얻게 될 것이다."
    },
    "straight_leg_raise": {
      "perfect": "엘프 전사의 유연성을 시험하는 고된 훈련을 완벽하게 마스터하다니, 용사, 그대는 진정 위대한 영웅의 자질을 갖추었도다! 대지의 정령이 그대의 강인한 다리에 축복을 내리고, 이제 그 힘으로 더욱 강력하게 마법 장비를 다룰 수 있게 되리라. 다음 여정에서는 어떤 놀라운 힘을 보여줄 것인가?",
      "good": "엘프 전사의 유연성 훈련을 마스터하며, 자네의 기사도는 더욱 빛을 발하는구려. 이제 새로운 검술의 초식이 자네를 기다리고 있을 것이오. 멈추지 말고, 용맹하게 나아가시오!",
      "normal": "따뜻한 햇살이 용사님의 얼굴을 비추는군요! 엘프 전사의 유연성 훈련을 무사히 마친 용사님은 한층 더 강인해졌습니다. 새로운 힘을 얻은 용사님, 이제 더 담대한 모험을 향해 나아가세요!"
    },
    "high_knees": {
      "perfect": "용사여, 그대의 발걸음은 대지를 울리고 심장을 고동치게 하니, 전장을 누비는 훈련을 완벽히 마쳤도다! 이제 그대의 마법 장비는 더욱 강력한 힘을 발휘하여, 왕국을 수호하는 빛이 되리라. 위대한 영웅의 서사시는 멈추지 않으니, 다음 훈련에서 더욱 놀라운 기적을 보여주길 기대하노라.",
      "good": "늠름한 기사여, 전장을 누비는 훈련을 마친 그대의 발걸음에서 강인함이 느껴지는군. 연마한 기운을 바탕으로 더 드높은 곳을 향해 나아가, 새로운 기술을 연마하게 될 것이네.",
      "normal": "새로운 힘이 느껴지는가, 용사여? 전장을 누비는 훈련을 통해 한층 더 성장했으니, 자부심을 가지도록 하라. 자, 이제 획득한 경험치를 발판 삼아 다음 여정을 향해 나아가자."
    },
    "side_plank": {
      "perfect": "방패를 든 용사의 기개, 그 굳건함에 마왕의 군세조차 감히 땅을 울리지 못하리라! 빛나는 투지와 함께 연마한 옆으로 버티기는 왕국을 수호하는 신성한 힘으로 승화될 것이오. 자, 이제 그대의 방패에 더욱 강력한 마법을 불어넣을 때가 왔도다!",
      "good": "흔들림 없는 그대의 방패는 더욱 견고해졌소. 옆으로 버티는 자세 수련을 통해, 그대의 기사도는 한층 더 깊어졌을 것이오. 곧 새로운 기술을 연마하여 더욱 강인한 용사로 거듭나리라 믿소.",
      "normal": "\"자네의 굳건한 방패 덕분에, 숲 속의 작은 위협은 사라졌네. 이제 자네는 한층 더 숙련된 용사로 발돋움할 준비가 되었네. 다음 여정에서는 더 큰 경험과 보상이 기다리고 있을 걸세.\""
    },
    "finger_flexion": {
      "perfect": "위대한 마법사여, 손가락을 굽히고 펴는 마법을 완벽하게 마스터했도다! 그대의 손가락에서 뿜어져 나오는 마나의 흐름이 고대 용의 숨결처럼 강력하니, 이제 어떤 봉인된 마법서도 그대의 손가락 하나로 열릴 것이오!",
      "good": "훌륭하오, 젊은 마법사여! 손가락을 굽히고 펴는 기술이 많이 향상되었소. 마나가 손가락 끝에서 안정적으로 모이고 있으니, 머지않아 대마법사의 반열에 오를 것이오!",
      "normal": "마법의 길은 멀고도 험하지만, 그대는 첫 발을 잘 내딛었소. 손가락의 움직임에서 마나의 기운이 느껴지니, 꾸준히 수련하면 반드시 빛을 볼 것이오."
    },
    "tendon_glide": {
      "perfect": "경이롭도다! 힘줄을 부드럽게 늘리는 비전을 완벽히 터득했으니, 그대의 손은 이제 고대 룬 문자를 새기듯 정교하게 움직이는구나. 전설의 마법 두루마리도 그대의 손놀림 앞에 비밀을 드러낼 것이오!",
      "good": "좋소, 수련자여! 힘줄 스트레칭 움직임이 점점 유려해지고 있소. 엘프의 활시위를 다루듯 섬세한 손놀림이니, 머지않아 고급 마법도 시전할 수 있을 것이오!",
      "normal": "모든 위대한 마법사도 처음에는 기초부터 시작했다오. 지금의 수련이 쌓여 훗날 드래곤의 비늘보다 강인한 손이 될 것이니, 포기하지 말고 정진하시오."
    },
    "thumb_opposition": {
      "perfect": "놀랍도다! 엄지로 손가락을 터치하는 마법 인장을 완벽하게 구현해냈구나! 그대의 엄지와 손가락이 만나는 순간 강력한 마나의 고리가 형성되니, 이제 고대의 봉인 마법도 다룰 수 있으리라!",
      "good": "잘하고 있소, 마법 수련생이여! 엄지 터치 기술이 안정되어 가고 있소. 마법 인장의 형태가 점점 선명해지니, 곧 상급 마법도 시전할 수 있을 것이오!",
      "normal": "마법 인장의 기초를 다지고 있구나. 엄지 터치는 모든 고급 마법의 시작점이니, 이 수련을 게을리하지 않는다면 반드시 대성할 것이오."
    },
    "finger_spread": {
      "perfect": "장엄하도다! 손가락을 활짝 벌리는 동작으로 완벽한 마법 방패를 펼쳐냈구나! 그대가 손을 펴는 순간 무적의 보호막이 형성되니, 이제 어떤 어둠의 마법도 그대를 해치지 못하리라!",
      "good": "훌륭하오! 손가락 벌리기 기술이 점점 강해지고 있소. 마법 방패의 범위가 넓어지고 있으니, 곧 동료들까지 보호할 수 있는 대마법사가 될 것이오!",
      "normal": "방어 마법의 기초를 닦고 있구나. 손가락을 펴는 동작 하나하나가 보호막의 강도를 높이니, 꾸준히 수련한다면 난공불락의 방패가 되리라."
    },
    "grip_squeeze": {
      "perfect": "전설의 용사여, 주먹을 꽉 쥐는 힘이 극의에 도달했도다! 그대가 검을 쥐는 순간 천둥 같은 힘이 느껴지니, 이제 전설의 성검 엑스칼리버도 그대의 손에서 빛을 발하리라!",
      "good": "좋소, 기사여! 검을 쥐는 힘이 점점 강해지고 있소. 악의 세력과 맞서 싸울 준비가 거의 되었으니, 조금만 더 정진하시오!",
      "normal": "검술의 기초는 강한 악력에서 시작된다오. 지금 쌓고 있는 힘이 훗날 마왕을 물리치는 결정적 한 수가 될 것이니, 매일 수련을 게을리 말라."
    },
    "wrist_flexion": {
      "perfect": "경탄스럽도다! 손목을 부드럽게 돌리는 마법을 완벽히 구현해냈구나! 그대가 마법 지팡이를 회전시키면 주변의 마나가 소용돌이치니, 이제 원소 마법의 달인이라 부를 수 있겠구나!",
      "good": "잘하고 있소! 손목 돌리기 동작이 점점 부드러워지고 있소. 지팡이를 다루는 솜씨가 좋아지고 있으니, 곧 바람과 물의 정령도 다룰 수 있을 것이오!",
      "normal": "마법 지팡이를 다루는 기초를 배우고 있구나. 손목의 유연함이 마법의 정확도를 결정하니, 이 수련을 통해 정밀한 마법 시전이 가능해지리라."
    },
    "seated_core_hold": {
      "perfect": "위대한 용사여, 앉아서 코어를 버티는 고대 명상 수련을 완벽하게 마스터했도다! 그대의 내면에 깃든 마나의 흐름이 더욱 안정되어, 이제 강력한 마법을 시전할 준비가 되었소. 현자 엘더린도 그대의 집중력에 감탄하는구나!",
      "good": "굳건해진 코어로 앉아 버티는 그대, 기사여. 고대 명상 수련의 성과가 느껴지는가? 현자의 가르침과 그대의 노력이 결실을 맺어, 곧 새로운 마법을 익힐 준비가 되었도다.",
      "normal": "새로운 힘이 느껴지시나요, 용사님? 앉아서 코어를 버티는 명상 수련을 통해 한층 더 안정적인 마나 흐름을 얻었습니다. 현자 엘더린이 그대의 성장을 지켜보고 있으니, 더욱 정진하시오."
    },
    "standing_march_slow": {
      "perfect": "용사여, 천천히 행진하는 기사의 의식 수련을 완벽하게 터득했도다! 그대의 위엄 있는 발걸음은 왕국 전체를 진동시키고, 마법 장비는 더욱 강력한 힘을 발휘할 것이다. 이제 새로운 전설의 장을 열어가라!",
      "good": "의연하게 행진하는 기사여, 천천히 행진 수련을 통해 그대의 품위가 한층 높아졌소. 현자가 준비한 새로운 훈련이 그대를 기다리고 있으니, 계속 정진하시오.",
      "normal": "따뜻한 햇살 아래 천천히 행진 수련을 마친 용사여, 그대의 꾸준함에 감탄하오. 작은 발걸음들이 모여 위대한 기사를 만들 듯, 이 경험이 그대의 여정에 빛나는 이정표가 될 것이오."
    },
    "seated_knee_lift": {
      "perfect": "경이롭도다! 앉아서 무릎을 드는 비전 수련을 완벽히 터득했으니, 그대의 다리에는 용의 힘이 깃들었구나. 전설의 마법사도 그대의 집중력 앞에 무릎을 꿇으리라!",
      "good": "좋소, 수련자여! 앉아서 무릎 들기 수련이 점점 능숙해지고 있소. 현자 엘더린이 그대를 위해 새로운 마법 주문을 준비해 두었으니, 기대해도 좋을 것이오!",
      "normal": "모든 위대한 기사도 처음에는 기초부터 시작했다오. 앉아서 무릎 들기 수련을 통해 쌓은 힘이 훗날 드래곤을 물리치는 원동력이 될 것이니, 포기하지 말고 정진하시오."
    },
    "wall_squat": {
      "perfect": "위대한 용사여, 벽에 기대어 버티는 성벽 수호 훈련을 완벽하게 마스터했도다! 그대의 굳건한 다리는 어떤 마왕의 군세도 막아낼 수 있음을 증명했소. 이제 전설의 방패를 손에 넣을 자격이 주어질 것이오!",
      "good": "굳건해진 다리로 버티는 그대, 기사여. 성벽 수호 훈련의 성과가 느껴지는가? 현자의 가르침과 그대의 인내가 결실을 맺어, 곧 새로운 방어술을 익히게 되리라.",
      "normal": "새로운 힘이 느껴지시나요, 용사님? 벽에 기대어 버티는 성벽 수호 훈련을 통해 한층 더 강인해진 다리는 앞으로 나아갈 용기를 북돋아 줄 것입니다."
    },
    "chair_stand": {
      "perfect": "경이롭도다! 왕좌에서 일어서는 동작을 완벽히 수행했으니, 그대는 진정한 왕의 자질을 갖추었구나. 일어서는 순간 방출되는 마나의 파동이 왕국 전체를 수호할 것이오!",
      "good": "좋소, 기사여! 왕좌 기립 훈련이 점점 강해지고 있소. 일어서는 동작에서 느껴지는 위엄이 대단하니, 곧 왕의 호위 기사로 임명될 것이오!",
      "normal": "왕좌에서 일어서는 기본을 익히고 있구나. 이 훈련이 쌓여 훗날 그대가 왕국을 수호하는 결정적 힘이 될 것이니, 매일 수련을 게을리하지 마라."
    },
    "standing_anti_extension_hold": {
      "perfect": "위대한 용사여, 서서 허리를 중립으로 유지하는 척추 마법 수련을 완벽하게 마스터했도다! 그대의 곧은 자세는 왕국의 기둥처럼 굳건하니, 이제 어떤 마법 공격도 그대를 흔들 수 없으리라!",
      "good": "굳건해진 허리로 서 있는 그대, 기사여. 척추 마법 수련의 성과가 느껴지는가? 현자 엘더린이 그대의 자세에 감탄하며, 새로운 방어 마법을 가르칠 준비를 하고 있다오.",
      "normal": "새로운 힘이 느껴지시나요, 용사님? 서서 허리를 버티는 척추 마법 수련을 통해 한층 더 안정적인 자세를 얻었습니다. 이 기초가 쌓여 강력한 마법사로 성장할 것입니다."
    },
    "standing_arm_raise_core": {
      "perfect": "경이롭도다! 서서 코어를 유지하며 팔을 드는 신성 기사 수련을 완벽히 터득했으니, 그대의 검술은 신의 영역에 도달했구나. 이제 전설의 성검도 그대의 손에서 진정한 빛을 발하리라!",
      "good": "좋소, 기사여! 서서 팔을 들며 코어를 유지하는 훈련이 점점 능숙해지고 있소. 검을 다루는 솜씨가 좋아지고 있으니, 곧 마왕의 군세도 물리칠 수 있을 것이오!",
      "normal": "신성 기사의 기초를 배우고 있구나. 서서 팔을 들며 코어를 유지하는 이 수련이 쌓여 훗날 왕국을 수호하는 영웅이 될 것이니, 정진하시오."
    }
  },
  "sports": {
    "squat": {
      "perfect": "환호성이 경기장을 가득 채우는 가운데, 챔피언의 하체 파워 트레이닝이 눈부신 승리를 완성했습니다. 트로피를 들어올릴 자격은 충분합니다. 이제, 다음 챔피언십을 향해 나아갈 시간입니다!",
      "good": "결승선을 향해 질주하는 자네의 모습이 보이는군. 하체 파워 트레이닝의 성과가 빛을 발하는 순간이야! 다음 경기에서 더 놀라운 기록을 세울 수 있도록, 코치인 나는 항상 자네 곁에 있네.",
      "normal": "새로운 역사를 쓸 다리가 되어줄 하체 파워 트레이닝, 오늘 그 첫 단추를 꿰었네. 코치의 격려와 팀원들의 환호 속에서 너는 이제 막 꿈을 향해 질주하기 시작했어."
    },
    "bridge": {
      "perfect": "코어 안정화 훈련의 완벽한 성공, 챔피언! 환호성이 경기장을 가득 채우고, 당신의 이름이 드높이 울려 퍼집니다. 트로피는 이미 당신의 손에 쥐어졌으니, 이제 다음 전설을 향해 나아갈 시간입니다.",
      "good": "탄탄한 브릿지 훈련으로 코어 근육이 한층 더 강해졌군! 네 챔피언십 우승을 향한 열정이 코트 위에서 빛을 발할 날이 머지않았어. 다음 훈련에서는 개인 최고 기록을 경신하는 기쁨을 맛보게 될 거야.",
      "normal": "새로운 코어 안정화 훈련을 마친 당신, 브릿지 자세처럼 단단해진 정신으로 챔피언십을 향한 첫걸음을 내딛습니다. 코치의 격려와 팀원들의 응원 속에서, 더욱 강인해질 내일을 기대하세요."
    },
    "dead_bug": {
      "perfect": "챔피언, 당신의 데드버그 훈련은 완벽했습니다! 코치와 팀원들의 환호 속에서 당신은 승리의 트로피를 들어 올리며 챔피언십 역사의 한 페이지를 장식했습니다. 이제, 더 높은 곳을 향해 나아갈 준비는 되었습니까?",
      "good": "새로운 기록을 향한 데드버그 훈련, 값진 땀방울이 너의 복근을 더욱 단단하게 만들었어. 코치님의 칭찬과 팀원들의 환호 속에서, 챔피언십 우승을 향한 너의 가능성은 더욱 커지고 있다! 다음 훈련에서는 더욱 놀라운 기록을 기대해도 좋을 거야.",
      "normal": "이제 데드버그 훈련을 마친 당신, 코트 위를 누빌 날이 머지않았습니다. 탄탄해진 복근은 승리를 향한 든든한 발판이 되어줄 겁니다. 더 강해진 당신의 내일을 기대하겠습니다."
    },
    "bird_dog": {
      "perfect": "결정적인 순간, 챔피언의 완벽한 버드독 자세는 승리의 깃발을 꽂았다. 코트 위 환호와 갈채 속에서 빛나는 트로피가 그의 손에 쥐어질 순간이 다가온다. 챔피언, 이제 다음 전설을 써내려갈 시간이다!",
      "good": "한 발 한 발, 버드독 자세를 통해 자네의 밸런스가 눈에 띄게 향상되었네. 챔피언십을 향한 꾸준한 노력이 빛을 발하는 순간이야. 다음 훈련에서는 개인 기록을 경신하는 자네의 모습을 기대하겠네!",
      "normal": "새로운 밸런스 트레이닝을 마친 당신, 코트 위에서 더욱 안정적인 움직임을 선보일 날이 머지않았습니다. 작은 균형들이 모여 승리의 역사를 만들어낼 것입니다. 다음 훈련에서는 더욱 놀라운 발전을 기대해도 좋습니다."
    },
    "plank_hold": {
      "perfect": "관중석의 함성이 챔피언의 심장을 더욱 뜨겁게 달군다! 체간 강화 훈련의 완벽한 성공, 그 증거로 빛나는 트로피가 눈앞에 놓였다. 이제 챔피언의 시대가 도래하리라!",
      "good": "새로운 기록 경신을 축하하네, 유망주! 자네의 체간 강화 훈련은 빛나는 결실을 맺고 있네. 다음 경기에서 더욱 강력한 모습으로 코트를 누빌 자네를 기대하겠어.",
      "normal": "새로운 체간 강화 훈련을 끝낸 당신, 코트 위를 누비는 꿈에 한 발짝 더 다가섰습니다. 희망을 품고 내일을 향해 나아가세요. 당신의 열정을 응원합니다."
    },
    "straight_leg_raise": {
      "perfect": "\"챔피언, 환호성이 들리는가! 그대의 강철 다리는 승리의 트로피를 들어올릴 자격이 충분하다. 이제 영광의 순간을 만끽하고, 다음 전설을 향해 나아가자!\"",
      "good": "탄탄하게 다져진 하체는 승리의 발판이 될 거야. 다리 들어올리기 훈련을 통해 더욱 강인해진 너의 투지가 챔피언십을 향한 질주를 이끌어 줄 거라 믿는다. 다음 훈련에서는 반드시 기록을 경신하리라!",
      "normal": "새로운 역사를 써내려갈 준비는 되었나, 신인 선수! 다리 근력 강화 훈련의 땀방울이 너를 더욱 단단하게 만들었으니, 이제 코트 위에서 꿈을 향해 힘차게 도약할 일만 남았어. 네 가능성은 무한하니, 빛나는 미래를 향해 나아가자."
    },
    "high_knees": {
      "perfect": "승리의 함성이 경기장에 울려 퍼진다! 챔피언, 심폐 지구력 훈련의 정점을 찍고 트로피를 들어올리는 순간, 당신의 이름이 역사에 새겨질 것이다. 이제 다음 전설을 향해 나아가라!",
      "good": "숨 가쁜 제자리 뛰기 훈련 끝에, 자네의 심장이 더욱 강하게 고동치는군. 코치의 격려처럼, 한계를 넘어선 자네는 이미 어제의 유망주가 아니네. 다음 경기에서 놀라운 기록을 기대하겠어.",
      "normal": "힘든 심폐 지구력 훈련을 끝낸 당신, 숨이 턱까지 차오르지만 코치의 격려에 다시 한번 힘을 냅니다. 이제 챔피언십을 향한 첫 걸음을 내딛었으니, 앞으로 더욱 강인해질 당신의 심장을 기대해도 좋습니다."
    },
    "side_plank": {
      "perfect": "챔피언, 완벽한 측면 코어 강화 훈련으로 승리의 트로피를 들어올릴 자격을 증명했네! 환호하는 관중 속에서 빛나는 그대의 모습은 영원히 기억될 걸세. 이제 다음 경기를 향해 나아가, 또 다른 전설을 써내려 가게!",
      "good": "견고해진 측면 코어만큼이나, 자네의 투지도 단단해졌구먼. 다음 경기는 더욱 날렵한 움직임으로 코트를 누빌 수 있을 걸세. 챔피언십을 향한 발걸음, 멈추지 말게!",
      "normal": "이제 당신은 균형을 잡아내는 법을 알았습니다. 코치님의 격려처럼, 당신의 잠재력은 무한합니다. 다음 챔피언십 라운드에서 더욱 강인한 모습으로 만날 수 있기를 기대합니다."
    },
    "finger_flexion": {
      "perfect": "선수, 손가락을 굽히고 펴는 훈련을 완벽하게 해냈어! 공을 잡는 그립감이 프로 수준이야. 이 정도 손가락 컨트롤이면 어떤 경기에서도 MVP 감이야!",
      "good": "좋아, 손가락 굽히기 훈련이 많이 좋아졌어! 볼 컨트롤에 필요한 섬세함이 느껴져. 조금만 더 연습하면 올스타 수준이 될 거야!",
      "normal": "기본기를 다지고 있구나. 손가락 굽히기는 모든 구기 종목의 기초야. 꾸준히 훈련하면 분명 좋은 결과가 있을 거야. 화이팅!"
    },
    "tendon_glide": {
      "perfect": "완벽해! 힘줄을 부드럽게 늘리는 훈련의 정점을 찍었어! 이 정도 손 유연성이면 피칭, 슈팅, 스윙 어느 동작에서도 최상의 컨트롤이 가능해!",
      "good": "힘줄 스트레칭이 점점 부드러워지고 있어! 손의 움직임이 자연스러워지면서 기술의 정확도도 올라가고 있어. 계속 이렇게 하자!",
      "normal": "힘줄 스트레칭 훈련 완료! 손의 유연성이 좋아지고 있어. 이런 기초 훈련이 부상 없이 오래 뛸 수 있게 해줘. 코치 박이 네 성장을 지켜보고 있으니 계속 파이팅!"
    },
    "thumb_opposition": {
      "perfect": "엄지 터치 훈련 완벽! 공을 잡고 던지는 그립이 프로 선수급이야. 이 정도 엄지 컨트롤이면 변화구도, 슬라이스도 완벽하게 구사할 수 있어!",
      "good": "엄지 터치가 좋아지고 있어! 그립의 안정감이 느껴져. 조금만 더 연습하면 어떤 장비도 완벽하게 컨트롤할 수 있을 거야!",
      "normal": "엄지 터치 훈련을 하고 있구나. 그립의 기초가 되는 중요한 훈련이야. 계속하면 공을 다루는 감각이 확실히 좋아질 거야!"
    },
    "finger_spread": {
      "perfect": "손가락 벌리기 훈련 완벽! 캐치 범위가 엄청나게 넓어졌어. 이 정도 손 펼침이면 어떤 공이 와도 놓치지 않을 거야. 골든글러브 감이야!",
      "good": "손가락 벌리기가 좋아지고 있어! 캐치 확률이 올라가고 있는 게 느껴져. 계속 연습하면 반사적으로 완벽한 캐치가 가능해질 거야!",
      "normal": "손가락 벌리기 훈련을 마쳤구나. 공을 잡는 범위가 넓어지고 있어. 꾸준히 하면 캐치 성공률이 확실히 올라갈 거야. 다음 훈련도 기대할게!"
    },
    "grip_squeeze": {
      "perfect": "주먹 쥐기 훈련 완벽! 악력이 프로 수준이야. 배트든 라켓이든 완벽하게 컨트롤할 수 있는 힘이 생겼어. 이제 파워 플레이도 문제없어!",
      "good": "주먹 쥐기 힘이 좋아지고 있어! 장비를 다루는 안정감이 늘었어. 조금만 더 훈련하면 경기 막판까지 흔들림 없는 그립을 유지할 수 있을 거야!",
      "normal": "주먹 쥐기 훈련을 하고 있구나. 악력은 모든 스포츠의 기본이야. 지금 쌓는 힘이 결정적 순간에 차이를 만들어낼 거야. 파이팅!"
    },
    "wrist_flexion": {
      "perfect": "손목 돌리기 훈련 완벽! 스핀과 컨트롤이 프로급이야. 이 손목 유연성이면 변화구, 스핀 서브, 슬라이스 어느 것이든 자유자재로 구사할 수 있어!",
      "good": "손목 돌리기가 점점 좋아지고 있어! 스윙의 스냅이 강해지고 있어. 계속 연습하면 다양한 구질과 샷을 구사할 수 있을 거야!",
      "normal": "손목 스트레칭 훈련 완료! 손목의 유연성이 기술의 다양성으로 이어져. 꾸준히 하면 플레이 범위가 넓어질 거야. 코치 박이 응원하고 있어!"
    },
    "seated_core_hold": {
      "perfect": "챔피언, 앉아서 코어를 버티는 훈련의 완벽한 성공! 환호성이 경기장을 가득 채우고, 당신의 탄탄한 코어는 어떤 경기에서도 흔들리지 않을 것입니다. 트로피를 향한 여정이 더욱 가까워졌습니다!",
      "good": "앉아서 코어를 버티는 훈련, 값진 땀방울이 네 복근을 더욱 단단하게 만들었어. 코치님의 칭찬과 팀원들의 환호 속에서, 다음 경기에서 더 놀라운 기록을 기대해도 좋을 거야.",
      "normal": "앉아서 코어 버티기 훈련을 마친 당신, 코트 위를 누빌 날이 머지않았습니다. 탄탄해진 코어는 승리를 향한 든든한 발판이 되어줄 겁니다."
    },
    "standing_march_slow": {
      "perfect": "환호성이 경기장을 가득 채우는 가운데, 천천히 행진 훈련이 눈부신 성공을 거두었습니다! 챔피언의 당당한 발걸음은 결승선을 향해 나아갈 준비가 완료되었음을 보여줍니다. 이제 다음 챔피언십을 향해 나아갈 시간입니다!",
      "good": "천천히 행진하는 훈련, 자네의 안정감 있는 발걸음이 보이는군. 코치인 나는 자네의 기본기가 탄탄해지고 있음을 느끼네. 다음 경기에서 더 놀라운 활약을 기대하겠어.",
      "normal": "천천히 행진 훈련을 마친 당신, 기본기를 다지는 것이 챔피언으로 가는 첫걸음입니다. 코치의 격려와 함께, 앞으로 더욱 강인해질 당신을 기대합니다."
    },
    "seated_knee_lift": {
      "perfect": "챔피언, 앉아서 무릎을 드는 훈련의 완벽한 성공! 탄탄해진 하복부 근육은 어떤 경기에서도 폭발적인 파워를 발휘할 것입니다. 트로피는 이미 당신의 손에 쥐어졌으니, 이제 다음 전설을 향해 나아갈 시간입니다.",
      "good": "앉아서 무릎 들기 훈련, 코어의 힘이 점점 강해지고 있어! 다음 경기에서는 더욱 강력한 폭발력을 보여줄 수 있을 거야. 코치로서 네 성장이 자랑스럽네.",
      "normal": "앉아서 무릎 들기 훈련을 마친 당신, 작은 성취가 모여 큰 승리를 만들어냅니다. 다음 훈련에서 더욱 발전된 모습을 기대하겠습니다."
    },
    "wall_squat": {
      "perfect": "관중석의 함성이 챔피언의 심장을 더욱 뜨겁게 달군다! 벽 스쿼트 훈련의 완벽한 성공, 그 증거로 강철 같은 하체가 완성되었다. 이제 어떤 경기에서도 흔들림 없는 지구력을 발휘할 것이다!",
      "good": "벽 스쿼트 훈련, 버티는 힘이 점점 강해지고 있어! 자네의 하체 지구력이라면 연장전에서도 끄떡없을 거야. 다음 경기에서 놀라운 활약을 기대하겠네.",
      "normal": "벽 스쿼트 훈련을 마친 당신, 인내는 승리의 어머니입니다. 코치의 격려와 함께, 앞으로 더욱 강인해질 당신의 하체를 기대합니다."
    },
    "chair_stand": {
      "perfect": "챔피언, 의자에서 일어나는 동작의 완벽한 성공! 폭발적인 하체 파워가 경기장을 진동시킵니다. 이제 어떤 순간에도 빠르게 반응할 수 있는 챔피언의 자질을 증명했습니다!",
      "good": "의자에서 일어나는 훈련, 폭발력이 점점 좋아지고 있어! 빠른 반응 속도가 경기의 승패를 가르지. 다음 경기에서 더 놀라운 기록을 기대하겠네.",
      "normal": "의자에서 일어나기 훈련을 마친 당신, 순간의 폭발력이 챔피언을 만듭니다. 코치의 격려와 함께, 더욱 강인해질 당신을 응원합니다."
    },
    "standing_anti_extension_hold": {
      "perfect": "챔피언, 서서 허리를 버티는 훈련의 완벽한 성공! 흔들림 없는 코어는 어떤 경기에서도 최상의 퍼포먼스를 발휘할 것입니다. 트로피를 향한 여정이 더욱 가까워졌습니다!",
      "good": "서서 허리 버티기 훈련, 자세가 점점 안정적이 되고 있어! 탄탄한 코어가 모든 기술의 기반이지. 다음 경기에서 더욱 날카로운 움직임을 기대하겠네.",
      "normal": "서서 허리 버티기 훈련을 마친 당신, 안정적인 코어가 챔피언의 기본입니다. 코치의 격려와 함께, 더욱 발전할 당신을 응원합니다."
    },
    "standing_arm_raise_core": {
      "perfect": "환호성이 경기장을 가득 채우는 가운데, 서서 팔 들며 코어 유지 훈련이 눈부신 성공을 거두었습니다! 전신 협응력이 완벽해진 챔피언, 이제 어떤 기술도 자유자재로 구사할 수 있습니다!",
      "good": "서서 팔 들며 코어 유지 훈련, 전신 협응력이 좋아지고 있어! 팔과 몸통의 연동이 완벽해지면 어떤 경기에서도 최상의 퍼포먼스를 발휘할 수 있지. 기대하겠네.",
      "normal": "서서 팔 들며 코어 유지 훈련을 마친 당신, 전신 협응력은 모든 스포츠의 기본입니다. 코치의 격려와 함께, 더욱 발전할 당신을 응원합니다."
    }
  },
  "idol": {
    "squat": {
      "perfect": "환호성이 귓가를 맴돌고, 무대 위 당신의 카리스마는 더욱 강렬하게 빛납니다. '무대 위 파워풀한 동작 훈련'의 완벽한 성공, 이제 팬덤은 당신의 이름으로 가득 찰 것입니다. 슈퍼스타의 전설은 바로 지금부터 시작입니다.",
      "good": "숨 가쁜 연습 끝에, 더욱 강렬해진 네 움직임은 무대를 압도할 준비를 마쳤음을 알려주는 듯해. 곧 공개될 새로운 안무, 네 열정으로 완벽하게 소화해내리라 믿어 의심치 않아.",
      "normal": "힘든 트레이닝에도 꿋꿋이 일어서는 당신, 무대 위 폭발적인 에너지를 뿜어낼 날이 머지않았어요. 빛나는 데뷔를 향한 당신의 열정을 응원하며, 다음 연습에서 더욱 멋진 모습으로 만나요!"
    },
    "bridge": {
      "perfect": "숨 막히는 브릿지 퍼포먼스, 그 완벽한 유연함에 객석은 열광으로 가득 찼다! 프로듀서도 인정한 눈부신 무대 장악력, 이제 당신의 팬덤은 은하수를 넘어 우주를 향해 뻗어 나갈 것이다. 다음 컴백 무대를 기대하라는 아우성이 벌써부터 들려오는 듯하다.",
      "good": "\"브릿지 훈련 덕분에 한결 부드러워진 춤선이 무대 위에서 더욱 빛날 거야. 새로운 안무에서도 네 유연함이 큰 도움이 될 거라고 프로듀서님이 칭찬하셨어. 다음 곡 센터는 이제 네 몫이나 다름없어!\"",
      "normal": "숨을 고르며 브릿지 동작을 마친 너. 땀방울이 송골송골 맺힌 얼굴 위로 따스한 햇살이 쏟아지네. 프로듀서님의 칭찬처럼, 데뷔를 향한 너의 유연한 날갯짓은 이제부터 시작이야."
    },
    "dead_bug": {
      "perfect": "숨 막히는 조명 아래, 완벽한 데드버그 동작으로 다져진 코어는 그 어떤 흔들림도 허락하지 않으리라. 환호하는 팬들의 함성이 들리는가! 슈퍼스타, 당신의 무대에 팬덤은 폭발적으로 증가할 것이다.",
      "good": "탄탄해진 코어, 이제 어떤 안무도 두렵지 않아! 네 춤선에 안정감이 더해진 만큼, 프로듀서님도 새로운 안무를 기대하는 눈치야. 다음 무대에서는 더욱 빛나는 네 모습을 보여줘!",
      "normal": "\"숨소리가 조금씩 차분해지는 걸 보니, 데드버그 훈련의 효과가 나타나는 것 같네. 탄탄해진 코어만큼, 너의 무대도 더욱 안정적으로 빛날 거야. 다음 곡 안무 연습, 기대해도 좋겠어.\""
    },
    "bird_dog": {
      "perfect": "완벽한 버드독, 우아한 밸런스를 위한 연습이 끝난 직후, 당신의 눈부신 아우라에 팬들은 더욱 열광할 겁니다. 프로듀서의 극찬과 멤버들의 환호 속에서, 당신의 팬덤은 폭발적으로 증가할 것입니다. 이제, 슈퍼스타의 다음 무대를 향해 나아가세요!",
      "good": "\"오늘의 우아한 밸런스를 위한 연습, 버드독 훈련 덕분에 네 춤선이 한층 더 아름다워졌어! 이 기세를 몰아, 새로운 안무 마스터에 도전해서 무대 위에서 더욱 빛나는 별이 되자!\"",
      "normal": "새로운 안무, '우아한 밸런스를 위한 연습'을 마스터하다니, 역시 해낼 줄 알았어! 데뷔를 향한 너의 열정은 무대 위 조명처럼 빛나고 있어. 이 기세를 몰아 다음 연습도 완벽하게 소화하자!"
    },
    "plank_hold": {
      "perfect": "숨 막히는 플랭크의 시간이 지나고, 무대 위 당신의 아우라는 더욱 강렬해졌습니다. 함성과 환호가 증명하듯, 팬덤은 폭발적으로 성장했고, 슈퍼스타의 전설은 이제부터 시작입니다. 다음 무대에서는 어떤 역사를 써내려갈까요?",
      "good": "새로운 안무를 위한 플랭크 버티기 훈련, 멋지게 해냈어! 흘린 땀방울만큼 너의 열정이 무대를 가득 채울 거야. 다음 곡에서는 더욱 놀라운 퍼포먼스를 보여줄 거라 믿어.",
      "normal": "\"플랭크 버티기 훈련, 끝까지 해냈군요! 흘린 땀방울만큼 꿈에 한 발짝 더 다가선 당신, 더욱 단단해진 체력으로 다음 무대를 기대해도 좋아요.\""
    },
    "straight_leg_raise": {
      "perfect": "새하얀 조명이 쏟아지는 무대 위, 완벽한 다리 라인을 뽐내며 환호에 답하는 당신은 진정한 슈퍼스타입니다. 팬들의 함성이 하늘을 찌르듯, 당신의 인기는 오늘 '레그 라인 챌린지' 성공 이후 폭발적으로 증가할 것입니다. 이제 다음 무대를 향해, 더욱 빛나는 내일을 준비하세요!",
      "good": "새로운 안무를 위한 '레그 라인 부스팅' 훈련, 성공! 멤버들과 함께 흘린 땀방울이 무대 위 빛나는 당신을 만들 겁니다. 다음 레벨, 더욱 완벽한 퍼포먼스를 기대해도 좋아요.",
      "normal": "\"오늘의 다리 라인을 위한 갈고 닦기 훈련, 수고했어! 꿈을 향한 너의 열정적인 발걸음이 무대 위에서 더욱 빛날 거야. 다음 연습에서는 더욱 놀라운 너를 기대할게!\""
    },
    "high_knees": {
      "perfect": "쏟아지는 환호성, 에너지 넘치는 무대를 위한 훈련의 완벽한 성공! 당신의 열정은 팬들의 마음을 사로잡았고, 팬덤은 폭발적으로 성장했습니다. 슈퍼스타의 길을 향해 더욱 빛나는 내일을 기대하세요!",
      "good": "숨 가쁜 에너지 훈련 끝에 찾아온 휴식, 멤버들의 환호가 쏟아지네! 프로듀서님의 칭찬처럼, 곧 선보일 새로운 안무도 완벽하게 소화할 수 있을 거야.",
      "normal": "숨 가쁘게 이어진 에너지 넘치는 무대를 위한 훈련, 제자리 뛰기. 땀방울이 증명하듯, 너의 열정은 무대 위 빛나는 별을 향해 한 걸음 더 나아갔어. 작은 성취들이 모여 꿈을 현실로 만들어 줄 거야."
    },
    "side_plank": {
      "perfect": "완벽한 옆으로 버티기, 세련된 몸매 관리로 무대를 압도할 준비를 마쳤군! 환호성이 들리는가? 너의 빛나는 노력에 팬덤이 폭발적으로 증가하고 있다! 다음 무대에서는 더욱 완벽한 슈퍼스타의 모습을 보여주길 기대하겠어!",
      "good": "새로운 안무의 센터 자리를 향한 열정, 세련된 몸매 관리로 더욱 빛나는 무대를 기대해도 좋아! 너의 노력은 곧 놀라운 결과로 이어질 거야. 다음 연습에서는 더욱 완벽한 춤선을 뽐낼 수 있을 거야.",
      "normal": "새로운 안무를 소화하기 위한 세련된 몸매 관리 훈련, 오늘은 여기까지야! 흘린 땀방울만큼 네 안의 가능성이 깨어났을 거야. 데뷔를 향한 빛나는 여정, 포기하지 말고 함께 나아가자."
    },
    "finger_flexion": {
      "perfect": "완벽해요! 손가락을 굽히고 펴는 동작이 정말 아름다워요! 이 정도 손가락 라인이면 팬사인회에서 하트 만들 때 팬들이 심장이 멎을 거예요!",
      "good": "손가락 굽히기가 점점 예뻐지고 있어요! 안무할 때 손끝까지 신경 쓰는 게 느껴져요. 조금만 더 연습하면 퍼펙트 아이돌이에요!",
      "normal": "손가락 굽히기 연습을 하고 있군요. 손끝까지 표현하는 게 아이돌의 기본이에요. 계속 연습하면 팬들의 시선을 사로잡을 수 있을 거예요!"
    },
    "tendon_glide": {
      "perfect": "대박! 힘줄을 부드럽게 늘리는 동작이 완벽해요! 손의 움직임이 너무 부드러워서 웨이브 안무도 완벽하게 소화할 수 있을 거예요!",
      "good": "힘줄 스트레칭이 점점 자연스러워지고 있어요! 손동작이 부드러워지면서 퍼포먼스 완성도가 올라가고 있어요. 곧 센터 감이에요!",
      "normal": "힘줄 스트레칭 연습을 시작했군요. 손의 유연성은 안무의 완성도를 높여줘요. 꾸준히 연습하면 어떤 안무도 자연스럽게 소화할 수 있을 거예요!"
    },
    "thumb_opposition": {
      "perfect": "엄지 터치 완벽! 손가락 하트, 브이 포즈, 다 완벽해요! 이 정도면 팬들 앞에서 어떤 포즈를 취해도 예쁘게 나올 거예요!",
      "good": "엄지 터치가 좋아지고 있어요! 포즈 취할 때 손모양이 예뻐지고 있어요. 셀카 찍을 때 손이 더 예쁘게 나올 거예요!",
      "normal": "엄지 터치 연습 중이군요. 사진 찍을 때 손모양이 중요해요. 계속 연습하면 어떤 각도에서도 예쁜 손이 될 거예요!"
    },
    "finger_spread": {
      "perfect": "손가락 벌리기 완벽! 손 펼침이 너무 예뻐요! 무대에서 손을 펼치면 조명이 반사되어 더 빛날 거예요. 진정한 스타의 손이에요!",
      "good": "손가락 벌리기가 좋아지고 있어요! 안무 중 손 동작이 더 크고 아름다워지고 있어요. 카메라에 잘 잡힐 거예요!",
      "normal": "손가락 벌리기 연습 중이군요. 무대에서 손을 크게 펼치면 존재감이 커져요. 계속 연습하면 더 멋진 퍼포먼스를 할 수 있을 거예요!"
    },
    "grip_squeeze": {
      "perfect": "주먹 쥐기 완벽! 마이크 잡는 손이 정말 안정적이에요! 이 정도면 격렬한 안무 중에도 마이크가 흔들리지 않을 거예요!",
      "good": "주먹 쥐기가 좋아지고 있어요! 마이크나 소품 잡는 게 더 안정적이에요. 무대에서 자신감 있게 퍼포먼스할 수 있을 거예요!",
      "normal": "주먹 쥐기 연습 중이군요. 마이크를 확실하게 잡는 건 라이브의 기본이에요. 계속 연습하면 어떤 무대에서도 안정감 있게 보일 거예요!"
    },
    "wrist_flexion": {
      "perfect": "손목 돌리기 완벽! 손목 동작이 정말 부드럽고 예뻐요! 포인트 안무에서 손목 스냅이 완벽해서 팬캠에 찍히면 대박 날 거예요!",
      "good": "손목 돌리기가 좋아지고 있어요! 안무 디테일이 살아나고 있어요. 조금만 더 연습하면 포인트 동작이 완벽해질 거예요!",
      "normal": "손목 돌리기 연습 중이군요. 손목의 유연함이 안무의 디테일을 살려줘요. 꾸준히 연습하면 더 세련된 퍼포먼스가 가능할 거예요!"
    },
    "seated_core_hold": {
      "perfect": "환호성이 귓가를 맴돌고, 앉아서 코어를 버티는 당신의 자세는 완벽합니다! 매니저 수진도 감탄할 만큼 탄탄한 코어는 무대 위 어떤 안무도 소화할 수 있음을 증명했어요. 슈퍼스타의 전설은 바로 지금부터 시작입니다!",
      "good": "앉아서 코어 버티기 훈련, 네 집중력은 무대 위에서 빛을 발할 거야. 매니저 수진이 곧 새로운 안무를 준비할 테니, 기대해도 좋아!",
      "normal": "앉아서 코어 버티기 연습 중이군요. 탄탄한 코어가 무대 위 안정감의 비결이에요. 빛나는 데뷔를 향한 당신의 열정을 응원해요!"
    },
    "standing_march_slow": {
      "perfect": "천천히 행진하는 당신의 모습에서 스타의 품격이 느껴집니다! 매니저 수진도 감탄하며, 곧 공개될 무대 퍼포먼스에서 당신의 우아한 워킹이 팬들의 마음을 사로잡을 것입니다. 슈퍼스타의 전설이 펼쳐집니다!",
      "good": "천천히 행진 연습, 네 우아한 발걸음이 무대를 압도할 준비를 마쳤어. 다음 공연에서 더 빛나는 워킹을 기대할게!",
      "normal": "천천히 행진 연습 중이군요. 스타의 걸음걸이는 자신감에서 나와요. 빛나는 무대를 향한 당신의 노력을 응원해요!"
    },
    "seated_knee_lift": {
      "perfect": "앉아서 무릎을 드는 당신의 동작이 완벽해요! 매니저 수진도 놀랄 만큼 유연하고 파워풀한 움직임은 어떤 안무도 소화할 수 있음을 증명했어요. 팬덤은 당신의 이름으로 가득 찰 거예요!",
      "good": "앉아서 무릎 들기 훈련, 네 하복부 근력이 점점 강해지고 있어! 다음 안무 연습에서 더 파워풀한 동작을 기대할게.",
      "normal": "앉아서 무릎 들기 연습 중이군요. 강한 코어가 파워풀한 댄스의 기본이에요. 빛나는 무대를 향해 계속 연습해요!"
    },
    "wall_squat": {
      "perfect": "벽에 기대어 버티는 당신의 인내심, 진정한 프로의 자질이에요! 매니저 수진도 감탄할 만큼 강인한 하체는 어떤 장시간 무대도 완벽하게 소화할 수 있음을 보여줍니다. 슈퍼스타의 전설이 시작됩니다!",
      "good": "벽 스쿼트 훈련, 버티는 힘이 점점 강해지고 있어! 긴 콘서트에서도 끄떡없는 체력이 생기고 있네. 기대할게!",
      "normal": "벽 스쿼트 연습을 마쳤군요! 긴 공연을 버티는 힘은 인내에서 나와요. 매니저 수진이 지켜보고 있으니, 빛나는 무대를 향해 계속 연습하면 어떤 무대도 완벽하게 소화할 수 있을 거예요!"
    },
    "chair_stand": {
      "perfect": "의자에서 일어나는 당신의 동작이 너무 세련됐어요! 매니저 수진도 감탄할 만큼 우아하고 파워풀한 기립은 무대 위 어떤 순간도 완벽하게 장악할 수 있음을 증명했어요. 팬들의 환호가 들려오네요!",
      "good": "의자에서 일어나기 훈련을 잘 해냈어요! 폭발적인 파워가 느껴져요. 다음 무대에서 더 강렬한 퍼포먼스를 보여줄 수 있을 거예요. 매니저 수진이 기대하고 있어요!",
      "normal": "의자에서 일어나기 연습을 마쳤군요! 무대 위 순간적인 동작이 팬들의 시선을 사로잡아요. 계속 연습하면 어떤 안무도 자신 있게 소화할 수 있을 거예요. 파이팅!"
    },
    "standing_anti_extension_hold": {
      "perfect": "서서 허리를 버티는 당신의 자세가 완벽해요! 매니저 수진도 감탄할 만큼 안정적인 코어는 어떤 안무도 흔들림 없이 소화할 수 있음을 증명했어요. 카메라 앞에서 더욱 빛날 거예요!",
      "good": "서서 허리 버티기 훈련을 잘 해냈어요! 자세가 점점 안정적이 되고 있어요. 다음 뮤비 촬영에서 더 완벽한 자세를 보여줄 수 있을 거예요. 매니저 수진이 응원해요!",
      "normal": "서서 허리 버티기 연습을 마쳤군요! 안정적인 자세가 아름다운 퍼포먼스의 기본이에요. 계속 연습하면 어떤 무대에서도 빛나는 존재감을 보여줄 수 있을 거예요!"
    },
    "standing_arm_raise_core": {
      "perfect": "서서 팔을 들며 코어를 유지하는 당신의 동작이 완벽해요! 매니저 수진도 감탄할 만큼 우아하고 안정적인 움직임은 어떤 포인트 안무도 완벽하게 소화할 수 있음을 증명했어요. 팬캠에 찍히면 대박 날 거예요!",
      "good": "서서 팔 들며 코어 유지 훈련, 전신 협응력이 좋아지고 있어! 다음 안무 연습에서 더 세련된 동작을 기대할게.",
      "normal": "서서 팔 들며 코어 유지 연습 중이군요. 팔을 들어도 흔들리지 않는 것이 프로의 자질이에요. 빛나는 무대를 향해 계속 연습해요!"
    }
  },
  "sf": {
    "squat": {
      "perfect": "함장님, 무중력 대비 하체 강화 훈련의 완벽한 성공입니다! 드높은 의지로 일어선 그 다리는 이제 미지의 행성을 디딜 자격을 증명했습니다. 은하계 최고 등급을 향한 여정, 아리아와 승무원들이 함장님과 함께하겠습니다.",
      "good": "\"훌륭합니다, 승무원! 무중력 대비 하체 강화 훈련 덕분에 행성 표면에서도 안정적인 활동이 가능하겠군요. 에너지 코어를 추가 확보하여 함선 업그레이드를 진행할 수 있게 되었습니다.\"",
      "normal": "새로운 행성을 밟기 위한 무중력 대비 하체 강화 훈련, 수고했어요! 탐험 경험치가 쌓였습니다. 아리아가 다음 탐험 구역을 분석 중이니, 곧 새로운 소식을 기대해도 좋습니다."
    },
    "bridge": {
      "perfect": "함장님, 완벽한 코어 안정화입니다! 정거장의 중력 균형이 회복되었고, 이제 미지의 행성으로 향하는 마지막 점프를 준비할 수 있습니다. 은하계 최고 등급 탐험가의 칭호가 눈앞에 있습니다.",
      "good": "정거장 코어 안정화 작업 성공! 브릿지 훈련 덕분에 흔들림이 잦았던 코어가 마침내 제자리를 찾았습니다. 이제 함선 업그레이드 보상을 받아 더 먼 우주로 나아갈 준비를 하세요.",
      "normal": "새로운 코어 안정화 훈련을 마치니, 아리아가 탐험 경험치 획득을 알린다. 이제 더 넓은 우주를 탐험할 준비가 되었으니, 미지의 행성을 향해 용감하게 나아가라."
    },
    "dead_bug": {
      "perfect": "함장님, 무중력 적응 훈련 '데드버그' 완벽하게 성공! 은하를 누빌 자격이 충분하십니다. 아리아가 함장님의 용맹을 기록했으니, 이제 은하계 최고 등급을 향해 나아가십시오.",
      "good": "새로운 무중력 적응 훈련을 완수한 당신, 놀라운 성과입니다! 함선 업그레이드에 필요한 귀한 데이터를 확보했으니, 이제 더 먼 우주로 나아갈 준비를 마쳐보세요.",
      "normal": "무중력 환경 적응 훈련을 마치니, 몸이 한결 가벼워진 기분입니다. 아리아, 탐험 경험치 획득을 축하해. 이제 미지의 행성을 향한 여정에 한 걸음 더 다가섰어."
    },
    "bird_dog": {
      "perfect": "함장님, '우주 유영 밸런스 훈련' 완벽하게 성공! 드넓은 우주를 탐험하는 함장님의 용기와 균형 감각은 은하계 최고 등급에 도달했습니다. 이제 미지의 행성으로 향할 준비를 마치고, 새로운 은하 영웅의 역사를 써내려 가십시오.",
      "good": "\"우주 유영 밸런스 훈련\" 완료, 훌륭합니다! 대원님의 향상된 코어 안정성은 탐사선의 중력 제어 시스템 업그레이드에 큰 도움이 될 겁니다. 이제 더 먼 우주로 나아갈 준비를 마쳤습니다.",
      "normal": "새로운 균형점을 찾았군요, 탐험가. 우주 유영 밸런스 훈련을 통해 얻은 감각으로 미지의 행성에서도 능숙하게 적응할 수 있을 겁니다. 탐험 경험치 획득! 다음 좌표를 설정하시겠습니까?"
    },
    "plank_hold": {
      "perfect": "함장님, 장기 임무 체력 유지 훈련 완벽하게 수행하셨습니다. 은하계 횡단을 위한 굳건한 의지와 강인한 체력이, 미지의 행성을 탐험할 자격을 증명합니다. 이제 은하계 최고 등급을 획득하고, 더 넓은 우주로 나아가십시오!",
      "good": "\"훌륭합니다, 대원! 장기 임무 체력 유지 훈련의 성과가 눈부시군요. 이 에너지를 동력 삼아, 곧 다가올 함선 업그레이드에 박차를 가해 봅시다.\"",
      "normal": "새로운 행성의 중력에도 굴하지 않고 장기 임무 체력 유지 훈련을 완수했군요. 탐험가님의 강인한 정신은 아리아도 감탄할 정도입니다. 이제 더 넓은 우주를 향해 나아갈 탐험 경험치를 획득했습니다."
    },
    "straight_leg_raise": {
      "perfect": "함장님, 중력 부스터 가동 훈련 완벽하게 소화하셨습니다! 이제 우주복은 함장님의 일부와 같습니다. 다음 훈련에서는 은하계 최고 등급을 획득하실 수 있을 겁니다.",
      "good": "\"우주복 착용 훈련\" 완료! 훌륭합니다, 승무원. 당신의 강인한 다리는 이제 더 먼 행성을 탐사할 준비가 되었군요. 함선 업그레이드가 곧 완료될 예정입니다.",
      "normal": "새로운 우주복이 네 다리에 완벽하게 맞춰졌어. 아리아가 분석한 데이터에 따르면, 자네의 근력이 향상되어 이제 행성 탐사에 필요한 모든 준비를 마쳤다네. 다음 훈련에서는 더욱 강력한 외골격을 착용하게 될 걸세."
    },
    "high_knees": {
      "perfect": "함장님, 비상 탈출 대비 체력 훈련 '스타 점프' 완벽하게 수행 완료! 은하계 최고 등급을 획득하시며, 전설의 함장님 칭호에 더욱 빛을 더하셨습니다. 이제, 아리아가 다음 탐험을 위한 새로운 좌표를 설정하겠습니다.",
      "good": "훌륭합니다, 승무원! 비상 탈출 대비 훈련을 완수하며 한계를 뛰어넘었군요. 이제 함선 업그레이드를 통해 더욱 먼 우주를 탐험할 준비를 마쳤으니, 아리아와 함께 새로운 미지의 행성을 탐사할 날을 기대하겠습니다.",
      "normal": "새로운 행성을 향한 도약 훈련을 마친 탐험가님, 한층 더 강인해진 당신의 발걸음이 느껴집니다. 아리아가 탐험 경험치를 지급했으니, 다음 여정을 위한 준비를 서두르세요. 미지의 세계가 당신을 기다립니다."
    },
    "side_plank": {
      "perfect": "함장님, 선외 활동 준비 훈련 완벽하게 완료! 이제 미지의 행성 '케플러-186f' 탐사도 두려울 것이 없습니다. 은하계 최고 등급을 향해, 아리아와 함께 전설을 써내려 갑시다!",
      "good": "선외 활동 준비 훈련 완료! 훌륭합니다, 승무원. 당신의 향상된 균형 감각은 탐사선의 안정적인 궤도 유지에 큰 도움이 될 겁니다. 이제 함선 업그레이드를 통해 더욱 먼 우주로 나아갈 준비를 마쳐보십시오.",
      "normal": "새로운 행성의 기운이 느껴집니다. 선외 활동 준비 훈련을 무사히 마친 탐험가님, 이제 미지의 세계를 향해 나아갈 준비가 거의 완료되었습니다. 탐험 경험치 획득! 곧 펼쳐질 당신의 용감한 발걸음을 아리아와 승무원 모두 응원하겠습니다."
    },
    "finger_flexion": {
      "perfect": "파일럿, 손가락을 굽히고 펴는 훈련 완료. 신경 인터페이스 동기화율 100%. 이 정밀도면 우주선의 모든 컨트롤을 밀리초 단위로 조작할 수 있습니다.",
      "good": "손가락 굽히기 데이터 양호. 신경 인터페이스 동기화율 상승 중. 조금 더 훈련하면 하이퍼드라이브 조작도 가능한 수준이 됩니다.",
      "normal": "파일럿, 손가락 굽히기 훈련을 완료했습니다. 신경 인터페이스 기초가 구축되고 있어요. AI 아리아가 지속적인 훈련을 권장합니다. 우주선 조종 정밀도가 향상될 거예요."
    },
    "tendon_glide": {
      "perfect": "힘줄 스트레칭 시퀀스 완벽. 바이오닉 인터페이스 호환성 최대. 이 수준의 유연성이면 외골격 슈트와의 완벽한 동기화가 가능합니다.",
      "good": "힘줄 스트레칭 프로토콜 진행 양호. 바이오닉 시스템 적응률 상승. 계속 훈련하면 고급 외골격 장비 사용 권한이 부여됩니다.",
      "normal": "파일럿, 힘줄 스트레칭 훈련을 마쳤습니다. 바이오닉 인터페이스 기초가 구축되고 있어요. 꾸준한 훈련으로 미래 기술과의 호환성이 높아질 거예요."
    },
    "thumb_opposition": {
      "perfect": "엄지 터치 완벽 보정. 홀로그램 인터페이스 조작 정밀도 최대. 이 손가락 컨트롤이면 3D 홀로그램 맵을 실시간으로 조작할 수 있습니다.",
      "good": "엄지 터치 데이터 양호. 홀로그램 터치 정확도 상승. 계속 훈련하면 복잡한 3D 인터페이스도 자유롭게 조작할 수 있습니다.",
      "normal": "파일럿, 엄지 터치 훈련을 완료했습니다. 터치 인터페이스 기초가 다져지고 있어요. 지속적인 연습으로 미래형 컨트롤 시스템에 적응할 수 있을 거예요."
    },
    "finger_spread": {
      "perfect": "손가락 벌리기 최적화 완료. 에너지 쉴드 전개 준비 완료. 이 손 펼침 범위면 우주선 전체를 보호하는 에너지 필드 생성이 가능합니다.",
      "good": "손가락 벌리기 데이터 양호. 에너지 필드 범위 확장 중. 계속 훈련하면 더 넓은 보호 영역을 생성할 수 있습니다.",
      "normal": "파일럿, 손가락 벌리기 훈련을 마쳤습니다. 에너지 조절 기초가 구축되고 있어요. 꾸준한 연습으로 방어 시스템 조작 능력이 향상될 거예요."
    },
    "grip_squeeze": {
      "perfect": "주먹 쥐기 최적화 완료. 메카닉 암 동기화율 100%. 이 악력이면 우주 광물을 맨손으로 분쇄하는 외골격도 완벽히 제어할 수 있습니다.",
      "good": "주먹 쥐기 데이터 양호. 메카닉 암 제어력 상승. 계속 훈련하면 대형 기계 장비도 정밀하게 조작할 수 있습니다.",
      "normal": "파일럿, 주먹 쥐기 훈련을 완료했습니다. 기계 장비 기초 제어력이 향상되고 있어요. 지속적인 연습으로 첨단 장비 조작 능력을 확보할 수 있을 거예요."
    },
    "wrist_flexion": {
      "perfect": "손목 돌리기 최적화 완료. 멀티 벡터 조이스틱 제어 완벽. 이 손목 유연성이면 6축 우주선을 동시에 조종하며 전투 기동이 가능합니다.",
      "good": "손목 돌리기 데이터 양호. 다축 제어 정밀도 상승. 계속 훈련하면 복잡한 기동도 자유롭게 수행할 수 있습니다.",
      "normal": "파일럿, 손목 굽히기 훈련을 마쳤습니다. 조이스틱 기초 제어력이 향상되고 있어요. 꾸준한 연습으로 우주선 조종에 필요한 손목 유연성을 확보할 수 있을 거예요."
    },
    "seated_core_hold": {
      "perfect": "함장님, 앉아서 코어를 버티는 무중력 적응 훈련의 완벽한 성공입니다! 아리아가 함장님의 코어 안정성 데이터를 분석한 결과, 은하계 최고 등급에 도달했습니다. 이제 장거리 워프 점프도 문제없이 수행할 수 있습니다!",
      "good": "앉아서 코어 버티기 훈련 완료! 훌륭합니다, 대원. 무중력 환경에서의 안정성이 향상되었으니, 곧 다가올 함선 업그레이드에 도움이 될 겁니다.",
      "normal": "새로운 무중력 코어 훈련을 마치니, 아리아가 탐험 경험치 획득을 알립니다. 이제 더 넓은 우주를 탐험할 준비가 되었으니, 미지의 행성을 향해 나아가세요."
    },
    "standing_march_slow": {
      "perfect": "함장님, 천천히 행진하는 저중력 보행 훈련의 완벽한 성공입니다! 아리아가 분석한 데이터에 따르면, 함장님의 발걸음은 어떤 행성 표면에서도 안정적입니다. 은하계 최고 등급 탐험가의 칭호에 걸맞은 성과입니다!",
      "good": "저중력 보행 훈련 완료! 훌륭합니다, 승무원. 당신의 안정적인 발걸음은 행성 탐사에서 큰 도움이 될 겁니다. 함선 업그레이드가 곧 완료될 예정입니다.",
      "normal": "저중력 보행 훈련을 마치니, 아리아가 탐험 경험치를 지급합니다. 천천히, 그러나 확실하게. 미지의 행성을 향한 여정에 한 걸음 더 다가섰습니다."
    },
    "seated_knee_lift": {
      "perfect": "함장님, 앉아서 무릎을 드는 우주선 기동 훈련의 완벽한 성공입니다! 아리아가 함장님의 하복부 근력 데이터를 분석한 결과, 은하계 최고 수준에 도달했습니다. 이제 어떤 비상 기동도 문제없이 수행할 수 있습니다!",
      "good": "우주선 기동 훈련 완료! 훌륭합니다, 대원. 빠른 반응 속도가 비상 상황에서 생존률을 높일 겁니다. 다음 훈련을 기대하겠습니다.",
      "normal": "우주선 기동 훈련을 마치니, 아리아가 탐험 경험치를 지급합니다. 어떤 상황에서도 움직일 수 있는 능력이 우주 탐험가의 기본입니다."
    },
    "wall_squat": {
      "perfect": "함장님, 벽에 기대어 버티는 장거리 항해 체력 훈련의 완벽한 성공입니다! 아리아가 분석한 데이터에 따르면, 함장님의 하체 지구력은 은하계 최고 수준입니다. 이제 몇 달간의 우주 항해도 문제없이 견딜 수 있습니다!",
      "good": "장거리 항해 체력 훈련 완료! 훌륭합니다, 승무원. 버티는 힘이 강해지고 있으니, 다음 임무에서 더욱 안정적인 활약을 기대하겠습니다.",
      "normal": "장거리 항해 체력 훈련을 마치니, 아리아가 탐험 경험치를 지급합니다. 인내심은 우주 탐험가의 필수 자질입니다."
    },
    "chair_stand": {
      "perfect": "함장님, 좌석에서 일어나는 비상 탈출 훈련의 완벽한 성공입니다! 아리아가 분석한 데이터에 따르면, 함장님의 반응 속도는 은하계 최고 수준입니다. 이제 어떤 비상 상황에서도 빠르게 대처할 수 있습니다!",
      "good": "비상 탈출 훈련 완료! 훌륭합니다, 대원. 빠른 기립 능력이 생존률을 크게 높일 겁니다. 함선 업그레이드가 곧 완료될 예정입니다.",
      "normal": "비상 탈출 훈련을 마치니, 아리아가 탐험 경험치를 지급합니다. 언제든 움직일 준비가 되어 있어야 하는 것이 우주 탐험가의 숙명입니다."
    },
    "standing_anti_extension_hold": {
      "perfect": "함장님, 서서 허리를 버티는 자세 안정화 훈련의 완벽한 성공입니다! 아리아가 분석한 데이터에 따르면, 함장님의 척추 정렬은 은하계 최고 수준입니다. 이제 정밀 조종 임무도 완벽하게 수행할 수 있습니다!",
      "good": "자세 안정화 훈련 완료! 훌륭합니다, 승무원. 안정적인 자세가 정밀 조종의 핵심이니, 다음 임무에서 더욱 정확한 조종을 기대하겠습니다.",
      "normal": "자세 안정화 훈련을 마치니, 아리아가 탐험 경험치를 지급합니다. 흔들림 없는 자세가 정밀한 우주선 조종의 기본입니다."
    },
    "standing_arm_raise_core": {
      "perfect": "함장님, 서서 팔을 들며 코어를 유지하는 복합 조종 훈련의 완벽한 성공입니다! 아리아가 분석한 데이터에 따르면, 함장님의 전신 협응력은 은하계 최고 수준입니다. 이제 복잡한 멀티태스킹 조종도 문제없이 수행할 수 있습니다!",
      "good": "복합 조종 훈련 완료! 훌륭합니다, 대원. 팔과 코어의 협응력이 향상되었으니, 다음 임무에서 더욱 정교한 조종을 기대하겠습니다.",
      "normal": "복합 조종 훈련을 마치니, 아리아가 탐험 경험치를 지급합니다. 팔을 움직여도 몸은 흔들리지 않는 것이 숙련된 파일럿의 자질입니다."
    }
  },
  "zombie": {
    "squat": {
      "perfect": "더 강해진 다리로 폐허를 질주하는 당신, 전설의 생존자여! 도주 대비 하체 강화 훈련의 완벽한 성공은 안전 구역 확보에 한 걸음 더 다가섰음을 의미합니다. 박 대장과 함께, 희망의 불씨를 지켜내십시오.",
      "good": "\"훌륭하군! 자네의 강철 다리는 앞으로 더 많은 좀비 떼를 따돌릴 수 있음을 증명했어. 박 대장이 자네를 위해 특별 보급품을 준비해두었으니, 곧 합류하도록!\"",
      "normal": "\"박 대장의 격려와 함께 도주 대비 하체 강화 훈련을 마친 당신, 한층 더 강인해진 다리로 폐허를 딛고 일어섭니다. 작은 성취들이 모여 내일의 생존을 보장하리라 믿으며, 당신은 새로운 희망을 발견합니다. 생존 경험치 획득!\""
    },
    "bridge": {
      "perfect": "심장이 다시 뛰기 시작한다. 브릿지 요새화 훈련의 완벽한 성공, 자네는 이제 진정한 생존 전문가로 거듭났네. 박 대장과 함께 안전 구역을 확장하고, 더 많은 동료를 맞이할 준비를 하게!",
      "good": "\"훌륭하군! 자네의 코어 강화 훈련 덕분에 다가올 위험 속에서도 더욱 민첩하게 움직일 수 있겠어. 박 대장이 자네를 위해 비축해 둔 귀한 보급품을 챙겨 가게나.\"",
      "normal": "\"자네, 브릿지 훈련 덕분에 한층 더 강해졌구먼. 박 대장도 자네의 회복력에 감탄할 걸세. 생존 경험치를 획득했으니, 다음 여정을 위한 준비를 시작해보는 건 어떤가?\""
    },
    "dead_bug": {
      "perfect": "완벽한 은신 자세 훈련으로 자네는 이제 진정한 그림자 전사가 되었네. 좀비 떼의 눈을 완벽히 속이고 안전 지역 확보에 한 걸음 더 다가섰으니, 이제 다음 작전을 준비하게. 박 대장과 함께 새로운 임무를 수행하며, 생존의 역사를 써내려 가게나.",
      "good": "훌륭하군! 은신 자세 훈련 덕분에 소리 없이 움직이는 능력이 향상됐어. 자, 이제 박 대장이 숨겨둔 보급품을 찾으러 가볼까?",
      "normal": "\"훌륭하군. 은신 자세 훈련 덕분에 자네의 생존 경험치가 조금 더 쌓였네. 박 대장도 자네의 발전을 눈여겨보고 있을 걸세. 다음 훈련에서도 살아남아, 더 강한 생존자가 되길 바라네.\""
    },
    "bird_dog": {
      "perfect": "전설의 생존자여, 불안정한 지형 적응 훈련을 완벽하게 마스터했군. 자네의 강인함 덕분에 안전 지역 확보가 더욱 가까워졌네. 이제 좀비 무리를 소탕하고, 새로운 희망을 찾아 나설 시간이야.",
      "good": "\"훌륭하군! 자네의 균형 감각이 불안정한 지형 적응 훈련을 통해 한층 더 날카로워졌어. 박 대장이 곧 자네에게 새로운 보급품을 전달해 줄 걸세. 다음 훈련도 기대하겠네.\"",
      "normal": "\"자네, 불안정한 지형 적응 훈련을 무사히 마쳤군. 박 대장도 자네의 끈기에 감탄할 걸세. 이제 자네는 더욱 강해졌으니, 생존 경험치를 발판 삼아 더 험난한 길을 헤쳐나가게 될 걸세.\""
    },
    "plank_hold": {
      "perfect": "더 이상의 좀비는 없다. 장시간 은폐 자세 유지 훈련을 완벽하게 수행한 당신 덕분에 놈들은 영원히 잊혀질 것이다. 이제 안전 지역을 확보하고 새로운 생존의 역사를 써내려 갈 시간이다.",
      "good": "훌륭하군! 자네의 플랭크 버티기 실력이 늘어난 덕분에 좀비 무리를 완벽하게 피할 수 있었어. 이제 박 대장과 함께 약속된 보급품을 챙겨 다음 은신처로 이동하도록 하지.",
      "normal": "\"훌륭하군! 자네의 은폐술 덕분에 좀비 무리를 따돌릴 수 있었어. 이제 박 대장에게 가서 생존 경험치를 받고 다음 임무를 준비하게나.\""
    },
    "straight_leg_raise": {
      "perfect": "장애물 극복 훈련을 완수한 당신은 이제 더욱 강인해졌습니다. 박 대장과 함께 안전 지역을 확보하고, 새로운 생존 기지를 건설하십시오. 전설은 계속될 것입니다.",
      "good": "훌륭합니다, 이제 다리 들어올리기 훈련을 통해 장애물 극복 능력이 한층 향상되었군요. 박 대장도 당신의 발전을 눈여겨보고 있습니다. 곧 훌륭한 보급품을 획득할 기회가 찾아올 겁니다.",
      "normal": "박 대장의 격려와 함께 장애물 극복 훈련을 마친 당신, 한층 더 강인해진 다리로 폐허를 헤쳐나갈 힘을 얻었습니다. 작은 성취들이 모여 희망의 불씨를 지피듯, 생존 경험치가 쌓여 당신을 더욱 숙련된 생존자로 만들어줄 것입니다."
    },
    "high_knees": {
      "perfect": "박 대장의 우렁찬 격려 속에 긴급 도주 체력 훈련을 완벽히 마스터했군! 자네의 강인한 다리는 이제 안전 지역을 확보하는 데 결정적인 역할을 할 걸세. 다음 목표는 더욱 위험한 구역의 정찰 임무다.",
      "good": "\"제자리 뛰기 훈련\"을 마치니, 숨이 턱까지 차오르지만 몸은 한결 가벼워진 기분입니다. 박 대장도 당신의 향상된 체력에 만족하는 눈치군요. 이제 더욱 안전하게 보급품을 찾아 나설 수 있겠습니다.",
      "normal": "\"자네의 긴급 도주 체력 훈련 덕분에 위기를 넘길 수 있었네. 박 대장도 자네의 성장을 눈여겨보고 있다네. 이제 다음 훈련을 통해 더욱 강해지게나.\""
    },
    "side_plank": {
      "perfect": "좀비 떼의 포위망을 뚫고, 좁은 공간 이동 훈련을 완벽하게 마스터하셨군요! 이제 당신은 진정한 전설의 생존자로서 한 걸음 더 나아갔습니다. 박 대장과 함께 확보한 안전 구역에서 잠시 숨을 돌리세요. 하지만 경계를 늦추지 마십시오. 더 험난한 시련이 당신을 기다리고 있습니다.",
      "good": "좁은 공간 이동 훈련을 마스터했군! 자네의 노련함 덕분에 다음 보급품 위치까지 안전하게 이동할 수 있겠어. 박 대장도 자네의 성장을 눈여겨보고 있다네.",
      "normal": "\"좁은 공간 이동 훈련\"을 끝내다니, 자네도 이제 어엿한 생존자 대열에 합류했네. 박 대장도 자네의 노력을 칭찬할 걸세. 앞으로 더 많은 훈련을 통해 강해져서, 우리 모두 함께 살아남아 보세."
    },
    "finger_flexion": {
      "perfect": "생존자여, 손가락을 굽히고 펴는 훈련이 완벽해! 방아쇠를 당기는 속도가 엄청나게 빨라졌어. 이 정도면 좀비 떼가 몰려와도 침착하게 대응할 수 있을 거야!",
      "good": "손가락 굽히기가 좋아지고 있어! 무기를 다루는 솜씨가 향상되고 있어. 조금만 더 연습하면 위기 상황에서도 침착하게 대처할 수 있을 거야!",
      "normal": "손가락 굽히기 훈련을 마쳤구나. 이 세상에서 살아남으려면 손가락 컨트롤이 중요해. 계속 연습하면 어떤 도구든 능숙하게 다룰 수 있을 거야. 생존자여, 파이팅!"
    },
    "tendon_glide": {
      "perfect": "힘줄 스트레칭 훈련 완벽! 손의 유연성이 대단해. 좁은 공간에서 도구를 다루거나 함정을 설치할 때 이 손놀림이 생존의 열쇠가 될 거야!",
      "good": "힘줄 스트레칭이 좋아지고 있어! 손이 더 유연해지면 복잡한 잠금장치도 풀 수 있을 거야. 폐허에서 물자를 찾을 때 큰 도움이 될 거야!",
      "normal": "힘줄 스트레칭 훈련 완료! 손의 유연성은 생존에 필수야. 계속 연습하면 어떤 상황에서도 빠르게 대응할 수 있을 거야. 살아남아라, 생존자!"
    },
    "thumb_opposition": {
      "perfect": "엄지 터치 완벽! 수류탄 핀을 빼거나 나이프를 잡는 그립이 프로급이야. 이 정도면 근접전에서도 좀비를 제압할 수 있을 거야!",
      "good": "엄지 터치가 좋아지고 있어! 도구를 잡는 안정감이 늘었어. 조금만 더 연습하면 위기 상황에서도 정확한 동작이 가능할 거야!",
      "normal": "엄지 터치 훈련을 마쳤구나. 정확한 그립은 생존의 기본이야. 계속 연습하면 어떤 도구든 확실하게 잡을 수 있을 거야. 생존자여, 계속 강해져라!"
    },
    "finger_spread": {
      "perfect": "손가락 벌리기 완벽! 벽을 타거나 물건을 잡는 범위가 엄청나게 넓어졌어. 이 정도면 어떤 상황에서도 탈출구를 찾을 수 있을 거야!",
      "good": "손가락 벌리기가 좋아지고 있어! 물건을 잡는 범위가 넓어지고 있어. 폐허에서 물자를 찾을 때 큰 도움이 될 거야!",
      "normal": "손가락 벌리기 훈련 완료! 손을 크게 펼칠 수 있으면 생존 확률이 올라가. 계속 연습하면 더 넓은 범위를 커버할 수 있어. 파이팅, 생존자!"
    },
    "grip_squeeze": {
      "perfect": "주먹 쥐기 완벽! 무기를 쥐는 힘이 엄청나. 이 악력이면 좀비의 손아귀에서도 탈출할 수 있고, 어떤 무기도 놓치지 않을 거야!",
      "good": "주먹 쥐기 힘이 좋아지고 있어! 무기를 쥐는 안정감이 늘었어. 조금만 더 훈련하면 장시간 전투에서도 버틸 수 있을 거야!",
      "normal": "주먹 쥐기 훈련을 마쳤구나. 강한 악력은 생존의 기본이야. 지금 쌓는 힘이 나중에 생사를 가를 수 있어. 계속 강해져라, 생존자!"
    },
    "wrist_flexion": {
      "perfect": "손목 돌리기 완벽! 무기를 휘두르는 동작이 너무 자연스러워. 이 손목 유연성이면 어떤 근접 무기도 자유자재로 다룰 수 있을 거야!",
      "good": "손목 돌리기가 좋아지고 있어! 무기를 휘두르는 힘이 강해졌어. 계속 연습하면 더 효율적인 공격이 가능할 거야!",
      "normal": "손목 스트레칭 훈련 완료! 손목의 유연함이 무기 사용의 핵심이야. 꾸준히 연습하면 다양한 무기를 자유자재로 다룰 수 있을 거야. 파이팅!"
    },
    "seated_core_hold": {
      "perfect": "전설의 생존자여, 앉아서 코어를 버티는 은신 훈련을 완벽하게 마스터했군! 자네의 집중력 덕분에 좀비 떼의 눈을 완벽히 속이고 안전 지역 확보에 한 걸음 더 다가섰네. 박 대장과 함께 새로운 희망을 찾아 나서게!",
      "good": "훌륭하군! 앉아서 코어를 버티는 은신 훈련 덕분에 자네의 집중력이 향상됐어. 박 대장이 자네를 위해 비축해 둔 귀한 보급품을 챙겨 가게나.",
      "normal": "앉아서 코어 버티기 훈련을 마친 자네, 이제 숨어서 버티는 시간이 더 길어졌군. 생존 경험치를 획득했으니, 다음 훈련에서도 살아남아 더 강한 생존자가 되길 바라네."
    },
    "standing_march_slow": {
      "perfect": "더 조용해진 발걸음으로 폐허를 누비는 당신, 전설의 생존자여! 천천히 행진 훈련의 완벽한 성공은 좀비들의 눈을 피해 안전 구역까지 도달할 수 있음을 증명합니다. 박 대장과 함께 희망의 불씨를 지켜내십시오.",
      "good": "훌륭하군! 천천히 행진 훈련 덕분에 자네의 발소리가 더욱 조용해졌어. 이제 좀비 떼를 더 쉽게 따돌릴 수 있겠군. 박 대장이 자네를 위해 보급품을 준비해 두었네.",
      "normal": "천천히 행진 훈련을 마친 당신, 조용한 발걸음이 생존의 열쇠입니다. 생존 경험치를 획득했으니, 앞으로 더욱 은밀하게 움직일 수 있을 겁니다."
    },
    "seated_knee_lift": {
      "perfect": "좀비 떼의 포위를 뚫고 나온 당신, 전설의 생존자여! 앉아서 무릎 들기 훈련의 완벽한 성공으로 어떤 좁은 공간에서도 빠르게 움직일 수 있음을 증명했습니다. 박 대장과 함께 안전 지역을 확보하십시오!",
      "good": "훌륭하군! 앉아서 무릎 들기 훈련 덕분에 좁은 공간에서도 빠르게 반응할 수 있겠군. 박 대장이 자네의 발전을 눈여겨보고 있네.",
      "normal": "앉아서 무릎 들기 훈련을 마친 자네, 이제 어떤 상황에서도 움직일 수 있는 힘을 얻었군. 생존 경험치를 획득했으니, 다음 위기에도 잘 대처할 수 있을 거야."
    },
    "wall_squat": {
      "perfect": "몇 시간이고 버틸 수 있는 당신, 전설의 생존자여! 벽에 기대어 버티는 대기 훈련의 완벽한 성공은 좀비 떼가 지나갈 때까지 숨어 있을 수 있음을 증명합니다. 박 대장과 함께 새로운 생존 기지를 건설하십시오!",
      "good": "훌륭하군! 벽에 기대어 버티는 훈련 덕분에 자네의 인내심이 더욱 강해졌어. 긴 대기 시간도 견딜 수 있겠군. 박 대장이 자네를 위해 보급품을 준비해 두었네.",
      "normal": "벽에 기대어 버티기 훈련을 마친 당신, 인내는 생존의 핵심입니다. 생존 경험치를 획득했으니, 앞으로 더욱 오래 버틸 수 있을 겁니다."
    },
    "chair_stand": {
      "perfect": "위기의 순간, 번개처럼 일어서는 당신, 전설의 생존자여! 의자에서 일어나는 긴급 탈출 훈련의 완벽한 성공은 어떤 갑작스러운 습격에도 빠르게 대처할 수 있음을 증명합니다. 박 대장과 함께 안전 지역을 확보하십시오!",
      "good": "훌륭하군! 의자에서 빠르게 일어나는 훈련 덕분에 자네의 반응 속도가 향상됐어. 갑작스러운 좀비 습격에도 빠르게 대처할 수 있겠군.",
      "normal": "의자에서 일어나기 훈련을 마친 당신, 빠른 반응이 생존을 좌우합니다. 생존 경험치를 획득했으니, 앞으로 더욱 빠르게 대처할 수 있을 겁니다."
    },
    "standing_anti_extension_hold": {
      "perfect": "흔들림 없이 버티는 당신, 전설의 생존자여! 서서 허리를 버티는 자세 훈련의 완벽한 성공은 장시간 경계를 서도 흔들림 없음을 증명합니다. 박 대장과 함께 안전 지역을 수호하십시오!",
      "good": "훌륭하군! 서서 허리를 버티는 훈련 덕분에 자네의 자세가 더욱 안정적이 되었어. 경계를 설 때 더욱 오래 버틸 수 있겠군.",
      "normal": "서서 허리 버티기 훈련을 마친 당신, 안정적인 자세가 효과적인 경계의 기본입니다. 생존 경험치를 획득했으니, 앞으로 더욱 오래 버틸 수 있을 겁니다."
    },
    "standing_arm_raise_core": {
      "perfect": "무기를 들어도 흔들리지 않는 당신, 전설의 생존자여! 서서 팔을 들며 코어를 유지하는 전투 훈련의 완벽한 성공은 어떤 무기도 정확하게 다룰 수 있음을 증명합니다. 박 대장과 함께 좀비 떼를 소탕하십시오!",
      "good": "훌륭하군! 서서 팔을 들며 코어를 유지하는 훈련 덕분에 자네의 무기 조준이 더욱 안정적이 되었어. 다음 전투에서 더욱 정확한 사격을 기대하겠네.",
      "normal": "서서 팔 들며 코어 유지 훈련을 마친 당신, 안정적인 자세가 정확한 사격의 기본입니다. 생존 경험치를 획득했으니, 앞으로 더욱 정확하게 조준할 수 있을 겁니다."
    }
  },
  "spy": {
    "squat": {
      "perfect": "불가능을 가능으로 만드는 당신, 역시 전설의 요원입니다. 잠입 작전 하체 강화를 완벽하게 수행한 당신에게 최고 기밀 접근 권한이 주어집니다. 이제, 다음 임무를 준비하십시오.",
      "good": "\"훌륭하군, 요원. '잠입 작전 하체 강화' 훈련을 성공적으로 마쳤습니다. 핸들러 오메가가 곧 신형 장비를 지급할 것이니, 다음 임무를 위해 만반의 준비를 갖추도록.\"",
      "normal": "\"신입, 이번 잠입 작전 하체 강화 훈련은 합격이다. 자네의 잠재력은 무궁무진하니, 앞으로 더 어려운 임무도 능히 해낼 수 있을 걸세. 훈련 점수가 상승했으니, 다음 훈련에서 더욱 발전된 모습을 기대하겠네.\""
    },
    "bridge": {
      "perfect": "요원, 완벽한 브릿지 훈련으로 강철 코어를 증명했군. 자네의 투지는 곧 다가올 그림자 속 작전에서도 빛을 발할 것이야. 최고 기밀 접근 권한이 활성화되었으니, 이제 다음 임무를 확인하게.",
      "good": "\"브릿지 훈련 종료. 탄탄해진 코어는 다음 작전에서 자네를 배신하지 않을 걸세. 핸들러 오메가가 곧 신형 소음 권총을 지급할 예정이니, 잠시 휴식을 취하도록.\"",
      "normal": "새로운 브릿지 훈련을 무사히 마친 요원, 이제 코어는 강철과 같겠군. 핸들러 오메가가 자네의 잠재력에 감탄하며 훈련 점수 상승을 승인했으니, 다음 임무에서 더욱 날카로운 움직임을 기대하겠네."
    },
    "dead_bug": {
      "perfect": "불가능해 보이는 은밀한 이동 코어 훈련을 완벽하게 소화해냈군. 자네의 투지와 기량은 전설의 요원이라는 칭호에 부족함이 없음을 증명했네. 이제 최고 기밀 접근 권한이 주어질 걸세. 다음 임무를 기대하겠네.",
      "good": "\"훌륭하군, 요원. '은밀한 이동 코어 훈련' 완수를 축하하네. 자네의 숙련된 움직임은 다음 작전에서 빛을 발할 걸세. 핸들러 오메가가 자네를 위해 신형 장비를 준비해 두었으니, 브리핑 룸으로 향하게.\"",
      "normal": "\"훌륭하군, 요원. '은밀한 이동 코어 훈련'을 성공적으로 마쳤으니, 이제 그림자 속에서 더욱 자유롭게 움직일 수 있겠어. 자네의 잠재력은 무궁무진하네. 다음 임무를 기대하겠네.\""
    },
    "bird_dog": {
      "perfect": "침착하고 완벽한 버드독, 정밀 사격 자세 훈련 완료. 전설은 총알처럼 날아와, 그림자처럼 사라진다. 이제 당신에게 최고 기밀 접근 권한이 주어질 것이다.",
      "good": "\"훌륭하군, 요원. '정밀 사격 자세 훈련' 덕분에 자네의 균형 감각이 한층 날카로워졌어. 오메가가 신형 위장 장비를 준비해 놓았으니, 다음 임무에서 활약해주길 기대하겠네.\"",
      "normal": "새로운 사격 자세 훈련을 무사히 마쳤군. 긴장을 늦추지 마. 자네의 잠재력은 무궁무진하니, 다음 임무에서는 더욱 놀라운 활약을 기대하겠네."
    },
    "plank_hold": {
      "perfect": "\"플랭크 버티기 훈련 완수. 전설의 요원이여, 그대의 강인한 정신력과 육체는 어떠한 감시 임무도 완수할 수 있음을 증명했소. 이제 최고 기밀 접근 권한이 해제되었으니, 다음 임무에서 그대의 능력을 마음껏 발휘하시오.\"",
      "good": "\"훌륭하군, 요원. 장시간 감시 체력 훈련을 성공적으로 마쳤네. 자네의 인내와 집중력이라면 어떤 임무든 완수할 수 있을 걸세. 핸들러 오메가가 곧 신형 장비를 지급할 걸세. 다음 훈련에서 다시 보지.\"",
      "normal": "\"신입, 장시간 감시 체력 훈련 완수. 이제 자네도 어엿한 그림자 요원으로 거듭나는 건가. 다음 훈련에서 더 날카로운 모습을 기대하겠네.\""
    },
    "straight_leg_raise": {
      "perfect": "마침내 격투 기술 유연성 훈련을 완벽하게 마스터했군. 자네의 투지와 집중력은 전설의 요원이라는 칭호에 걸맞아. 이제 최고 기밀 접근 권한이 주어질 것이다. 다음 임무를 준비하게.",
      "good": "임무 완수, 요원. 격투 기술 유연성 훈련을 통해 자네의 다리는 더욱 날카로운 무기가 되었네. 핸들러 오메가가 곧 신형 장비를 지급할 걸세. 다음 임무를 기대하겠네.",
      "normal": "오늘의 격투 기술 유연성 훈련, 다리 들어올리기 과제를 완수했군. 자네의 가능성은 무궁무진해. 핸들러 오메가가 자네의 성장을 주시하고 있으니, 다음 훈련에서도 최고의 기량을 보여주길 바라네."
    },
    "high_knees": {
      "perfect": "숨 가쁜 추격 대비 심폐 훈련을 완수한 당신, 역시 전설의 요원답군. 핸들러 오메가도 감탄을 금치 못하는군요. 이제 당신에게 최고 기밀 접근 권한이 주어질 겁니다.",
      "good": "\"훌륭해, 요원. 추격 대비 심폐 훈련을 성공적으로 마쳤군. 자네의 투지와 강인함이라면 다음 작전에서도 혁혁한 공을 세울 수 있을 거야. 핸들러 오메가가 자네에게 신형 장비를 지급할 예정이니 기대해도 좋을 걸세.\"",
      "normal": "\"훌륭하군, 요원. '추격 대비 심폐 훈련' 완수 덕분에 자네의 잠재력이 한층 더 개화했어. 핸들러 오메가가 자네의 훈련 점수 상승을 보고 기뻐할 걸세. 다음 임무에서 더 놀라운 활약을 기대하겠네.\""
    },
    "side_plank": {
      "perfect": "벽 타기 준비 훈련 완벽하게 완료. 전설의 요원이여, 이제 그 누구도 당신의 잠입을 막을 수 없으리라. 최고 기밀 접근 권한이 당신을 기다립니다.",
      "good": "\"벽 타기 준비 훈련\"을 성공적으로 마쳤군. 자네의 놀라운 균형 감각과 집중력이라면, 다음 작전에서도 혁혁한 공을 세울 수 있을 걸세. 오메가가 곧 신형 장비를 지급할 걸세.",
      "normal": "벽 타기 준비 훈련을 무사히 마친 당신, 이제 그림자 속에서 더욱 날렵하게 움직일 수 있을 겁니다. 핸들러 오메가도 당신의 성장을 눈여겨보고 있으니, 다음 임무에서는 더욱 놀라운 활약을 기대하겠습니다. 훈련 점수가 상승했습니다."
    },
    "finger_flexion": {
      "perfect": "요원, 손가락 굽히기 훈련을 완벽하게 수행했군. 손끝 제어 능력이 최상급이야. 이 정도면 정밀 폭발물 해체나 금고 다이얼 조작 임무도 문제없이 수행할 수 있을 거야. 핸들러 오메가가 자네를 주목하고 있네.",
      "good": "신입, 손가락 굽히기 훈련을 잘 마쳤군. 손가락 컨트롤이 향상되고 있어. 조금만 더 훈련하면 중급 잠금장치 해제 권한도 부여받을 수 있을 거야. 계속 정진하게.",
      "normal": "신입, 손가락 굽히기 훈련을 완수했군. 자네의 손가락 컨트롤이 향상되고 있어. 핸들러 오메가가 자네의 성장을 지켜보고 있으니, 다음 훈련에서도 좋은 성과를 기대하겠네."
    },
    "tendon_glide": {
      "perfect": "요원, 힘줄 스트레칭 훈련을 완벽하게 마쳤군. 손 유연성이 최상급이야. 이 정도면 레이저 보안망 통과나 정밀 잠입 임무도 승인받을 수 있을 거야. 훌륭한 성과야.",
      "good": "신입, 힘줄 스트레칭 훈련을 잘 수행했군. 유연성이 향상되고 있어. 계속 훈련하면 복잡한 잠금장치 해제도 가능해질 거야. 좋은 진전이야.",
      "normal": "신입, 힘줄 스트레칭 훈련을 마쳤군. 손의 유연성이 향상되면 침투 능력도 좋아질 거야. 지속적으로 훈련하면 어떤 잠금장치도 해제할 수 있게 될 거야."
    },
    "thumb_opposition": {
      "perfect": "요원, 엄지 터치 훈련을 완벽하게 수행했군. 그립 정밀도가 최상급이야. 이 정도면 권총 조준이나 폭발물 설치 임무도 문제없이 수행할 수 있을 거야. 대단한 실력이야.",
      "good": "신입, 엄지 터치 훈련을 잘 마쳤군. 그립 안정성이 향상되고 있어. 장비 조작 정확도가 상승하고 있으니, 계속 이 조자로 훈련하면 좋은 요원이 될 거야.",
      "normal": "신입, 엄지 터치 훈련을 완료했군. 그립의 기초를 다지고 있어. 정확한 그립은 요원의 기본 자질이니, 계속 정진하면 어떤 장비도 능숙하게 다룰 수 있을 거야."
    },
    "finger_spread": {
      "perfect": "요원, 손가락 벌리기 훈련을 완벽하게 마쳤군. 손 펼침 범위가 최대야. 이 정도면 다중 장비 동시 조작이나 넓은 키패드 입력 임무도 가능할 거야. 훌륭해.",
      "good": "신입, 손가락 벌리기 훈련을 잘 수행했군. 손 펼침 능력이 향상되고 있어. 복잡한 장비 조작도 곧 가능한 수준이 될 거야. 계속 훈련하게.",
      "normal": "신입, 손가락 벌리기 훈련을 마쳤군. 손 펼침 범위가 넓어지면 장비 조작 효율이 올라갈 거야. 핸들러 오메가가 자네의 발전을 주시하고 있으니, 계속 훈련하게."
    },
    "grip_squeeze": {
      "perfect": "요원, 주먹 쥐기 훈련을 완벽하게 수행했군. 악력 수치가 최상급이야. 이 정도면 적 제압, 로프 타기, 중장비 조작 모두 문제없이 해낼 수 있을 거야. 대단해.",
      "good": "신입, 주먹 쥐기 훈련을 잘 마쳤군. 악력이 향상되고 있어. 조금만 더 훈련하면 중급 제압술도 익힐 수 있을 거야. 좋은 진전이야.",
      "normal": "신입, 주먹 쥐기 훈련을 완수했군. 악력이 조금씩 강해지고 있어. 강한 그립은 요원의 생존 능력이니, 꾸준히 훈련하면 어떤 상황에서도 버틸 수 있을 거야."
    },
    "wrist_flexion": {
      "perfect": "요원, 손목 굽히기 훈련을 완벽하게 마쳤군. 손목 유연성이 최상급이야. 이 정도면 자물쇠 피킹이나 정밀 장비 조작 S급 임무도 승인받을 수 있을 거야. 훌륭한 실력이야.",
      "good": "신입, 손목 굽히기 훈련을 잘 수행했군. 손목 컨트롤이 향상되고 있어. 계속 훈련하면 복잡한 장치 해제도 가능해질 거야. 좋은 진전이야.",
      "normal": "신입, 손목 굽히기 훈련을 마쳤군. 손목의 유연함이 임무의 성패를 가르지. 지속적으로 단련하면 정밀 장비 조작 능력이 향상될 거야."
    },
    "seated_core_hold": {
      "perfect": "불가능해 보이는 임무도 자네라면 해낼 수 있다는 것을 증명했군, 요원. 은폐 자세 코어 훈련을 완벽하게 수행한 당신에게 최고 기밀 접근 권한이 주어집니다. 핸들러 오메가도 자네의 집중력에 감탄을 금치 못하는군요. 이제 다음 임무를 준비하십시오.",
      "good": "\"훌륭하군, 요원. 은폐 자세 코어 훈련을 성공적으로 마쳤네. 핸들러 오메가가 곧 자네를 위한 신형 장비를 지급할 예정이니, 다음 임무에서 더욱 날카로운 활약을 기대하겠네.\"",
      "normal": "\"신입, 은폐 자세 코어 훈련 완수를 축하하네. 자네의 잠재력은 무궁무진하니, 그림자 속에서 더욱 안정적으로 버틸 수 있을 걸세. 훈련 점수가 상승했으니, 다음 훈련에서 더욱 발전된 모습을 기대하겠네.\""
    },
    "standing_march_slow": {
      "perfect": "발소리 하나 없이 적진을 통과하는 자네의 모습은 마치 그림자 그 자체로군. 잠입 보행 훈련을 완벽하게 마스터한 요원에게 최고 기밀 접근 권한이 주어집니다. 핸들러 오메가도 자네의 은밀함에 탄복했네. 전설의 요원이라는 칭호에 걸맞은 성과일세.",
      "good": "\"훌륭하군, 요원. 잠입 보행 훈련 덕분에 자네의 발걸음은 한층 더 가벼워졌어. 오메가가 야간 작전용 신형 장비를 준비해 놓았으니, 다음 임무에서 활약해주길 기대하겠네.\"",
      "normal": "\"천천히, 그러나 확실하게. 잠입 보행 훈련을 마친 자네는 이제 그림자처럼 움직이는 법을 알기 시작했네. 핸들러 오메가가 자네의 성장을 주시하고 있으니, 다음 훈련에서도 최고의 기량을 보여주게.\""
    },
    "seated_knee_lift": {
      "perfect": "어떤 제한된 공간에서도 자네는 민첩하게 움직일 수 있음을 증명했군. 의자 기동 훈련을 완벽하게 수행한 요원에게 사무실 침투 작전 수행 권한이 부여됩니다. 핸들러 오메가도 자네의 순발력에 감탄했네. 이제 다음 임무를 준비하게.",
      "good": "\"훌륭하군, 요원. 의자 기동 훈련 덕분에 제한된 공간에서도 빠르게 반응할 수 있겠군. 오메가가 곧 정찰 임무용 장비를 지급할 테니, 잠시 휴식을 취하도록.\"",
      "normal": "\"신입, 의자 기동 훈련을 무사히 마쳤군. 어떤 상황에서든 움직일 수 있어야 하는 것이 요원의 기본이니, 앞으로 더욱 정진하게. 훈련 점수가 상승했네.\""
    },
    "wall_squat": {
      "perfect": "몇 시간이고 버틸 수 있는 자네의 인내심은 전설의 요원에 걸맞은 자질이군. 벽면 지지 훈련을 완벽하게 수행한 당신에게 장시간 감시 임무 수행 권한이 주어집니다. 핸들러 오메가도 자네의 끈기에 감탄했네. 이제 다음 임무를 준비하게.",
      "good": "\"훌륭하군, 요원. 벽면 지지 훈련을 성공적으로 마쳤네. 자네의 하체 지구력이 한층 강해졌으니, 다음 대기 임무에서는 더욱 안정적인 모습을 보여줄 수 있을 걸세.\"",
      "normal": "\"기다림도 임무의 일부라네, 신입. 벽면 지지 훈련을 통해 자네의 인내심이 조금 더 단련되었군. 핸들러 오메가가 자네의 성장을 눈여겨보고 있으니, 계속 정진하게.\""
    },
    "chair_stand": {
      "perfect": "위기의 순간, 번개처럼 일어서는 자네의 반응 속도는 전설의 요원답군. 신속 기립 훈련을 완벽하게 수행한 당신에게 긴급 탈출 작전 수행 권한이 주어집니다. 핸들러 오메가도 자네의 순발력에 감탄을 금치 못하는군요. 다음 임무를 기대하겠네.",
      "good": "\"훌륭하군, 요원. 신속 기립 훈련 덕분에 자네의 반응 속도가 눈에 띄게 향상됐어. 오메가가 경호 임무용 신형 장비를 준비해 놓았으니, 다음 작전에서 활약해주길 기대하겠네.\"",
      "normal": "\"언제든 움직일 준비가 되어야 하는 것이 요원의 숙명이지. 신속 기립 훈련을 마친 자네는 이제 위기 상황에서도 빠르게 대응할 수 있을 걸세. 훈련 점수가 상승했네.\""
    },
    "standing_anti_extension_hold": {
      "perfect": "흔들림 없는 자세로 정밀 사격 자세를 유지하는 자네의 집중력은 전설의 요원에 걸맞군. 척추 중립 유지 훈련을 완벽하게 수행한 당신에게 최고 기밀 접근 권한이 주어집니다. 핸들러 오메가도 자네의 자세 통제력에 탄복했네. 다음 임무를 준비하게.",
      "good": "\"훌륭하군, 요원. 척추 중립 유지 훈련 덕분에 자네의 자세가 한층 안정적이 되었군. 오메가가 저격 훈련 프로그램을 준비해 놓았으니, 다음 단계로 나아갈 준비를 하게.\"",
      "normal": "\"정확한 임무 수행의 기본은 흔들림 없는 자세라네. 척추 중립 훈련을 마친 자네는 이제 더욱 안정적인 사격 자세를 유지할 수 있을 걸세. 훈련 점수가 상승했네.\""
    },
    "standing_arm_raise_core": {
      "perfect": "팔을 움직여도 몸은 미동도 하지 않는 자네의 전신 제어 능력은 경이롭군. 상체 협응 훈련을 완벽하게 수행한 요원에게 복합 장비 운용 임무 권한이 주어집니다. 핸들러 오메가도 자네의 기량에 감탄했네. 전설의 요원이라는 칭호가 빛을 발하는군.",
      "good": "\"훌륭하군, 요원. 상체 협응 훈련 덕분에 팔과 코어의 연동이 눈에 띄게 향상됐어. 오메가가 중급 작전용 장비를 준비해 놓았으니, 다음 임무에서 활약해주길 기대하겠네.\"",
      "normal": "\"팔을 움직여도 몸은 흔들리지 않아야 하는 것이 요원의 기본이지. 상체 협응 훈련을 마친 자네는 이제 더욱 정교한 장비 조작이 가능할 걸세. 훈련 점수가 상승했네.\""
    }
  }
}