{
  "fantasy": {
    "squat": {
      "perfect": "위대한 용사여, 기사의 하체 단련 훈련을 완벽하게 마스터했으니 그대의 다리는 강철처럼 단단해졌소. 이제 그 힘으로 전설의 검에 깃든 마력을 더욱 증폭시켜, 다가올 어둠을 물리치시오!",
      "good": "굳건해진 다리로 일어서는 그대, 기사. 하체 단련 훈련의 성과가 느껴지는가? 현자의 가르침과 그대의 노력이 결실을 맺어, 곧 새로운 검술을 연마할 수 있게 되리라.",
      "normal": "새로운 힘이 느껴지시나요, 용사님? 기사의 하체 단련 훈련을 통해 한층 더 강인해진 다리는 앞으로 나아갈 용기를 북돋아 줄 것입니다. 이제 더 많은 경험치를 얻고, 더욱 강력한 몬스터에 도전하세요!"
    },
    "lunge": {
      "perfect": "용사여, 전진 돌격 훈련을 완벽하게 수행했도다! 한 발 한 발 내딛는 그대의 발걸음에서 왕국을 수호하는 기사의 위엄이 느껴지는구나. 이제 그대의 돌격은 어떤 마물도 막을 수 없으리라!",
      "good": "견고한 자세로 전진하는 그대의 모습이 인상적이군. 전진 돌격 훈련을 통해 연마된 기량은 곧 새로운 전투 기술로 발현될 것이네. 현자도 그대의 성장을 기대하고 있소.",
      "normal": "용사님, 전진 돌격 훈련을 마쳤군요! 아직 완벽하진 않지만, 꾸준한 노력은 반드시 빛을 발할 거예요. 다음 훈련에서는 더욱 강인한 모습을 보여주세요!"
    },
    "bicep_curl": {
      "perfect": "대장간의 망치를 다루듯 완벽한 팔 단련이었소, 용사여! 그대의 팔에 깃든 힘은 이제 전설의 검도 가볍게 휘두를 수 있으리라. 왕국의 수호자로서 그대의 무용담이 더해지는구나!",
      "good": "묵직한 무기를 들어올리는 그대의 팔에서 기사의 기품이 느껴지는군. 팔 힘 단련 훈련의 성과가 나타나고 있소. 곧 더 강력한 마법 무기를 다룰 수 있게 될 것이오.",
      "normal": "용사님, 팔 힘 단련 훈련을 마쳤습니다! 조금씩 강해지는 팔의 힘이 느껴지시나요? 꾸준히 정진하면 전설의 영웅처럼 강해질 수 있을 거예요!"
    },
    "arm_raise": {
      "perfect": "용사여, 마법진 활성화 훈련을 완벽하게 수행했도다! 하늘 높이 뻗은 그대의 팔에서 마나의 파동이 느껴지는구나. 이제 그대는 고대 마법사들의 비술도 사용할 수 있으리라!",
      "good": "마나를 끌어올리듯 팔을 높이 드는 그대의 자세가 훌륭하군. 마법진 활성화 훈련 덕분에 그대의 마법 친화력이 향상되었소. 현자께서 기뻐하실 것이오.",
      "normal": "용사님, 마법진 활성화 훈련을 마쳤어요! 팔을 높이 드는 동작이 조금씩 자연스러워지고 있네요. 더 연습하면 강력한 마법도 시전할 수 있을 거예요!"
    },
    "high_knees": {
      "perfect": "용사여, 그대의 발걸음은 대지를 울리고 심장을 고동치게 하니, 전장을 누비는 훈련을 완벽히 마쳤도다! 이제 그대의 마법 장비는 더욱 강력한 힘을 발휘하여, 왕국을 수호하는 빛이 되리라. 위대한 영웅의 서사시는 멈추지 않으니, 다음 훈련에서 더욱 놀라운 기적을 보여주길 기대하노라.",
      "good": "늠름한 기사여, 전장을 누비는 훈련을 마친 그대의 발걸음에서 강인함이 느껴지는군. 연마한 기운을 바탕으로 더 드높은 곳을 향해 나아가, 새로운 기술을 연마하게 될 것이네.",
      "normal": "새로운 힘이 느껴지는가, 용사여? 전장을 누비는 훈련을 통해 한층 더 성장했으니, 자부심을 가지도록 하라. 자, 이제 획득한 경험치를 발판 삼아 다음 여정을 향해 나아가자."
    },
    "plank_hold": {
      "perfect": "불굴의 의지 수련을 완수한 용사여, 그대의 정신은 강철처럼 단단해졌소! 이제 그대의 검에 깃든 마력이 더욱 강력해져, 왕국을 수호하는 빛이 될 것이오. 다음 시련을 통해 더욱 위대한 영웅으로 거듭나시오.",
      "good": "\"불굴의 의지 수련\"을 통해 자네의 기사로서의 자질이 한층 더 굳건해졌네. 자, 이제 곧 새로운 기술을 연마하여 더욱 강대한 적에 맞설 준비를 해야 할 때가 왔네. 현자의 지혜와 마법사 동료의 도움을 받아 더욱 빛나는 기사가 되기를 바라네.",
      "normal": "\"불굴의 의지 수련\"을 끝낸 용사여, 그대의 인내심에 경의를 표한다. 작은 시작이지만, 그대의 여정은 이제 막 시작되었으니 희망을 잃지 마라. 앞으로 나아갈수록 더 많은 경험과 지혜를 얻게 될 것이다."
    }
  },
  "sports": {
    "squat": {
      "perfect": "환호성이 경기장을 가득 채우는 가운데, 챔피언의 하체 파워 트레이닝이 눈부신 승리를 완성했습니다. 트로피를 들어올릴 자격은 충분합니다. 이제, 다음 챔피언십을 향해 나아갈 시간입니다!",
      "good": "결승선을 향해 질주하는 자네의 모습이 보이는군. 하체 파워 트레이닝의 성과가 빛을 발하는 순간이야! 다음 경기에서 더 놀라운 기록을 세울 수 있도록, 코치인 나는 항상 자네 곁에 있네.",
      "normal": "새로운 역사를 쓸 다리가 되어줄 하체 파워 트레이닝, 오늘 그 첫 단추를 꿰었네. 코치의 격려와 팀원들의 환호 속에서 너는 이제 막 꿈을 향해 질주하기 시작했어."
    },
    "lunge": {
      "perfect": "챔피언, 폭발적인 전진 스텝 트레이닝의 완벽한 성공! 관중석의 환호가 경기장을 가득 메우고 있습니다. 당신의 강인한 다리는 어떤 상대도 압도할 것입니다!",
      "good": "훌륭해, 선수! 전진 스텝 트레이닝이 네 경기력을 한 단계 끌어올렸어. 다음 시합에서 더욱 날카로운 움직임을 보여줄 수 있을 거야. 코치로서 기대하고 있네.",
      "normal": "전진 스텝 트레이닝을 끝낸 당신, 이제 코트 위에서 더 날렵하게 움직일 수 있을 겁니다. 작은 발전들이 모여 챔피언을 만드는 법이니, 다음 훈련도 화이팅!"
    },
    "bicep_curl": {
      "perfect": "챔피언, 완벽한 암 컬 트레이닝! 당신의 팔에서 뿜어져 나오는 파워가 관중들을 열광시키고 있습니다. 트로피를 들어올릴 그 팔의 힘, 대단합니다!",
      "good": "좋아, 선수! 팔 근력 트레이닝의 성과가 보이기 시작했어. 더 강한 스윙, 더 정확한 슛을 위한 기반이 다져지고 있네. 다음 훈련에서 한계를 넘어보자!",
      "normal": "팔 근력 트레이닝을 마친 당신, 이제 경기에서 더 힘 있는 플레이를 펼칠 수 있을 겁니다. 꾸준함이 승리의 비결이니, 계속 정진하세요!"
    },
    "arm_raise": {
      "perfect": "챔피언, 세레모니 암 레이즈 트레이닝 완벽! 승리의 순간, 트로피를 높이 들어올릴 당신의 모습이 눈에 선합니다. 그 자격을 충분히 증명했습니다!",
      "good": "멋져, 선수! 어깨 가동성 트레이닝이 네 움직임을 더욱 유연하게 만들었어. 경기 중 빠른 반응이 가능해질 거야. 코치로서 자랑스럽네.",
      "normal": "어깨 가동성 트레이닝을 끝낸 당신, 작은 발전이지만 분명한 성장입니다. 다음 경기에서 더 나은 모습으로 코트에 설 수 있을 거예요!"
    },
    "high_knees": {
      "perfect": "승리의 함성이 경기장에 울려 퍼진다! 챔피언, 심폐 지구력 훈련의 정점을 찍고 트로피를 들어올리는 순간, 당신의 이름이 역사에 새겨질 것이다. 이제 다음 전설을 향해 나아가라!",
      "good": "숨 가쁜 제자리 뛰기 훈련 끝에, 자네의 심장이 더욱 강하게 고동치는군. 코치의 격려처럼, 한계를 넘어선 자네는 이미 어제의 유망주가 아니네. 다음 경기에서 놀라운 기록을 기대하겠어.",
      "normal": "힘든 심폐 지구력 훈련을 끝낸 당신, 숨이 턱까지 차오르지만 코치의 격려에 다시 한번 힘을 냅니다. 이제 챔피언십을 향한 첫 걸음을 내딛었으니, 앞으로 더욱 강인해질 당신의 심장을 기대해도 좋습니다."
    },
    "plank_hold": {
      "perfect": "관중석의 함성이 챔피언의 심장을 더욱 뜨겁게 달군다! 체간 강화 훈련의 완벽한 성공, 그 증거로 빛나는 트로피가 눈앞에 놓였다. 이제 챔피언의 시대가 도래하리라!",
      "good": "새로운 기록 경신을 축하하네, 유망주! 자네의 체간 강화 훈련은 빛나는 결실을 맺고 있네. 다음 경기에서 더욱 강력한 모습으로 코트를 누빌 자네를 기대하겠어.",
      "normal": "새로운 체간 강화 훈련을 끝낸 당신, 코트 위를 누비는 꿈에 한 발짝 더 다가섰습니다. 희망을 품고 내일을 향해 나아가세요. 당신의 열정을 응원합니다."
    }
  },
  "idol": {
    "squat": {
      "perfect": "환호성이 귓가를 맴돌고, 무대 위 당신의 카리스마는 더욱 강렬하게 빛납니다. '무대 위 파워풀한 동작 훈련'의 완벽한 성공, 이제 팬덤은 당신의 이름으로 가득 찰 것입니다. 슈퍼스타의 전설은 바로 지금부터 시작입니다.",
      "good": "숨 가쁜 연습 끝에, 더욱 강렬해진 네 움직임은 무대를 압도할 준비를 마쳤음을 알려주는 듯해. 곧 공개될 새로운 안무, 네 열정으로 완벽하게 소화해내리라 믿어 의심치 않아.",
      "normal": "힘든 트레이닝에도 꿋꿋이 일어서는 당신, 무대 위 폭발적인 에너지를 뿜어낼 날이 머지않았어요. 빛나는 데뷔를 향한 당신의 열정을 응원하며, 다음 연습에서 더욱 멋진 모습으로 만나요!"
    },
    "lunge": {
      "perfect": "슈퍼스타의 워킹 레슨 완벽! 런웨이를 걷는 듯한 당신의 자태에 팬들이 열광하고 있어요. 다음 팬미팅에서 더욱 빛나는 모습을 보여주세요!",
      "good": "런지 트레이닝 덕분에 네 무대 동선이 한층 우아해졌어! 프로듀서님도 감탄하셨다구. 새로운 안무에서 네 매력이 더 빛날 거야.",
      "normal": "워킹 레슨을 마친 당신, 이제 무대 위에서 더 자신감 있게 움직일 수 있을 거예요. 팬들이 당신의 성장을 응원하고 있어요!"
    },
    "bicep_curl": {
      "perfect": "팬서비스 포즈 연습 완벽! 당신의 팔선이 카메라 앞에서 더욱 빛나고 있어요. 팬들의 환호가 들리나요? 당신은 진정한 슈퍼스타입니다!",
      "good": "팔 근력 훈련 덕분에 응원봉을 들어올리는 네 모습이 더 멋있어졌어! 콘서트에서 팬들과 더 열정적으로 소통할 수 있을 거야.",
      "normal": "팔 근력 훈련을 마친 당신, 작은 발전이지만 무대 위 퍼포먼스에 분명 도움이 될 거예요. 꾸준히 연습해서 더 빛나는 아이돌이 되세요!"
    },
    "arm_raise": {
      "perfect": "환호에 답하는 완벽한 암 레이즈! 무대 위에서 팔을 높이 드는 당신의 모습에 팬들이 열광하고 있어요. 슈퍼스타의 아우라가 빛나네요!",
      "good": "앵콜 웨이브 연습 성공! 팔을 높이 드는 네 자세가 정말 우아해졌어. 다음 콘서트에서 팬들의 마음을 사로잡을 준비가 됐네.",
      "normal": "웨이브 연습을 마친 당신, 조금씩 더 자연스러워지고 있어요. 팬들에게 더 멋진 모습을 보여줄 그날을 위해 화이팅!"
    },
    "high_knees": {
      "perfect": "쏟아지는 환호성, 에너지 넘치는 무대를 위한 훈련의 완벽한 성공! 당신의 열정은 팬들의 마음을 사로잡았고, 팬덤은 폭발적으로 성장했습니다. 슈퍼스타의 길을 향해 더욱 빛나는 내일을 기대하세요!",
      "good": "숨 가쁜 에너지 훈련 끝에 찾아온 휴식, 멤버들의 환호가 쏟아지네! 프로듀서님의 칭찬처럼, 곧 선보일 새로운 안무도 완벽하게 소화할 수 있을 거야.",
      "normal": "숨 가쁘게 이어진 에너지 넘치는 무대를 위한 훈련, 제자리 뛰기. 땀방울이 증명하듯, 너의 열정은 무대 위 빛나는 별을 향해 한 걸음 더 나아갔어. 작은 성취들이 모여 꿈을 현실로 만들어 줄 거야."
    },
    "plank_hold": {
      "perfect": "숨 막히는 플랭크의 시간이 지나고, 무대 위 당신의 아우라는 더욱 강렬해졌습니다. 함성과 환호가 증명하듯, 팬덤은 폭발적으로 성장했고, 슈퍼스타의 전설은 이제부터 시작입니다. 다음 무대에서는 어떤 역사를 써내려갈까요?",
      "good": "새로운 안무를 위한 플랭크 버티기 훈련, 멋지게 해냈어! 흘린 땀방울만큼 너의 열정이 무대를 가득 채울 거야. 다음 곡에서는 더욱 놀라운 퍼포먼스를 보여줄 거라 믿어.",
      "normal": "\"플랭크 버티기 훈련, 끝까지 해냈군요! 흘린 땀방울만큼 꿈에 한 발짝 더 다가선 당신, 더욱 단단해진 체력으로 다음 무대를 기대해도 좋아요.\""
    }
  },
  "sf": {
    "squat": {
      "perfect": "함장님, 무중력 대비 하체 강화 훈련의 완벽한 성공입니다! 드높은 의지로 일어선 그 다리는 이제 미지의 행성을 디딜 자격을 증명했습니다. 은하계 최고 등급을 향한 여정, 아리아와 승무원들이 함장님과 함께하겠습니다.",
      "good": "\"훌륭합니다, 승무원! 무중력 대비 하체 강화 훈련 덕분에 행성 표면에서도 안정적인 활동이 가능하겠군요. 에너지 코어를 추가 확보하여 함선 업그레이드를 진행할 수 있게 되었습니다.\"",
      "normal": "새로운 행성을 밟기 위한 무중력 대비 하체 강화 훈련, 수고했어요! 탐험 경험치가 쌓였습니다. 아리아가 다음 탐험 구역을 분석 중이니, 곧 새로운 소식을 기대해도 좋습니다."
    },
    "lunge": {
      "perfect": "함장님, 행성 착륙 돌진 훈련 완벽하게 수행! 낯선 중력에도 흔들림 없는 전진, 은하계 최고의 탐험가다운 모습입니다. 아리아가 다음 탐험 좌표를 준비하겠습니다.",
      "good": "훌륭합니다, 승무원! 행성 착륙 돌진 훈련 덕분에 험한 지형에서도 안정적인 이동이 가능해졌습니다. 함선 업그레이드 보상을 기대해도 좋을 겁니다.",
      "normal": "행성 착륙 돌진 훈련을 마쳤군요. 탐험 경험치가 쌓였습니다. 아리아가 당신의 성장을 기록하고 있으니, 다음 임무에서 더 나은 모습을 보여주세요."
    },
    "bicep_curl": {
      "perfect": "함장님, 화물 운반 훈련 완벽! 무거운 보급품도 가볍게 다루는 그 힘, 장거리 탐사에서 큰 도움이 될 것입니다. 은하계 최고 등급을 향해 나아가십시오!",
      "good": "훌륭합니다, 승무원! 화물 운반 훈련으로 팔 근력이 향상되었습니다. 외계 유물 수집 임무에서 활약을 기대합니다.",
      "normal": "화물 운반 훈련을 마쳤습니다. 탐험 경험치가 쌓였으니, 더 먼 우주를 향한 준비를 계속하세요. 아리아가 응원하고 있습니다."
    },
    "arm_raise": {
      "perfect": "함장님, 신호 송출 훈련 완벽하게 수행! 높이 뻗은 그 팔로 은하 저편에 신호를 보낼 수 있게 되었습니다. 은하계 최고 등급을 향한 여정이 계속됩니다!",
      "good": "훌륭합니다, 승무원! 신호 송출 훈련 덕분에 원거리 통신 능력이 향상되었습니다. 다음 탐사에서 유용하게 쓰일 것입니다.",
      "normal": "신호 송출 훈련을 마쳤습니다. 작은 발전이지만, 아리아가 당신의 성장을 기록했습니다. 다음 임무를 기대해주세요."
    },
    "high_knees": {
      "perfect": "함장님, 비상 탈출 대비 체력 훈련 '스타 점프' 완벽하게 수행 완료! 은하계 최고 등급을 획득하시며, 전설의 함장님 칭호에 더욱 빛을 더하셨습니다. 이제, 아리아가 다음 탐험을 위한 새로운 좌표를 설정하겠습니다.",
      "good": "훌륭합니다, 승무원! 비상 탈출 대비 훈련을 완수하며 한계를 뛰어넘었군요. 이제 함선 업그레이드를 통해 더욱 먼 우주를 탐험할 준비를 마쳤으니, 아리아와 함께 새로운 미지의 행성을 탐사할 날을 기대하겠습니다.",
      "normal": "새로운 행성을 향한 도약 훈련을 마친 탐험가님, 한층 더 강인해진 당신의 발걸음이 느껴집니다. 아리아가 탐험 경험치를 지급했으니, 다음 여정을 위한 준비를 서두르세요. 미지의 세계가 당신을 기다립니다."
    },
    "plank_hold": {
      "perfect": "함장님, 장기 임무 체력 유지 훈련 완벽하게 수행하셨습니다. 은하계 횡단을 위한 굳건한 의지와 강인한 체력이, 미지의 행성을 탐험할 자격을 증명합니다. 이제 은하계 최고 등급을 획득하고, 더 넓은 우주로 나아가십시오!",
      "good": "\"훌륭합니다, 대원! 장기 임무 체력 유지 훈련의 성과가 눈부시군요. 이 에너지를 동력 삼아, 곧 다가올 함선 업그레이드에 박차를 가해 봅시다.\"",
      "normal": "새로운 행성의 중력에도 굴하지 않고 장기 임무 체력 유지 훈련을 완수했군요. 탐험가님의 강인한 정신은 아리아도 감탄할 정도입니다. 이제 더 넓은 우주를 향해 나아갈 탐험 경험치를 획득했습니다."
    }
  },
  "zombie": {
    "squat": {
      "perfect": "더 강해진 다리로 폐허를 질주하는 당신, 전설의 생존자여! 도주 대비 하체 강화 훈련의 완벽한 성공은 안전 구역 확보에 한 걸음 더 다가섰음을 의미합니다. 박 대장과 함께, 희망의 불씨를 지켜내십시오.",
      "good": "\"훌륭하군! 자네의 강철 다리는 앞으로 더 많은 좀비 떼를 따돌릴 수 있음을 증명했어. 박 대장이 자네를 위해 특별 보급품을 준비해두었으니, 곧 합류하도록!\"",
      "normal": "\"박 대장의 격려와 함께 도주 대비 하체 강화 훈련을 마친 당신, 한층 더 강인해진 다리로 폐허를 딛고 일어섭니다. 작은 성취들이 모여 내일의 생존을 보장하리라 믿으며, 당신은 새로운 희망을 발견합니다. 생존 경험치 획득!\""
    },
    "lunge": {
      "perfect": "전설의 생존자여, 폐허 돌파 훈련을 완벽하게 수행했군! 장애물을 넘어 전진하는 자네의 다리는 이제 어떤 좀비 무리도 돌파할 수 있으리라. 안전 구역 확보를 위해 나아가자!",
      "good": "훌륭하군! 폐허 돌파 훈련 덕분에 자네의 전진력이 한층 강해졌어. 박 대장도 자네의 성장을 눈여겨보고 있다네. 보급품 획득 기회가 곧 찾아올 걸세.",
      "normal": "폐허 돌파 훈련을 마친 당신, 생존 경험치가 쌓였습니다. 작은 발전이지만, 내일의 생존을 위한 귀한 투자입니다. 박 대장과 함께 힘내세요."
    },
    "bicep_curl": {
      "perfect": "전설의 생존자여, 바리케이드 강화 훈련을 완벽하게 수행! 자네의 강인한 팔은 이제 어떤 방어선도 구축할 수 있으리라. 안전 구역 확보에 한 걸음 더 다가섰군!",
      "good": "훌륭하군! 바리케이드 강화 훈련으로 자네의 팔 힘이 늘었어. 보급품 운반 임무에서 크게 활약할 수 있을 걸세. 박 대장이 자네를 기대하고 있다네.",
      "normal": "바리케이드 강화 훈련을 마쳤군. 생존 경험치가 쌓였으니, 다음 임무를 위해 준비하게. 박 대장과 함께 희망을 지켜내자."
    },
    "arm_raise": {
      "perfect": "전설의 생존자여, 구조 신호 훈련을 완벽하게 수행! 높이 뻗은 그 팔로 구조 헬기를 부를 수 있게 되었군. 안전 구역이 눈앞에 있다!",
      "good": "훌륭하군! 구조 신호 훈련 덕분에 자네의 어깨가 한층 강해졌어. 위험 상황에서 신호를 보내는 데 큰 도움이 될 걸세.",
      "normal": "구조 신호 훈련을 마쳤군. 생존 경험치가 쌓였으니, 희망을 잃지 말고 다음 훈련을 준비하게. 우리 모두 함께 살아남아 보세."
    },
    "high_knees": {
      "perfect": "박 대장의 우렁찬 격려 속에 긴급 도주 체력 훈련을 완벽히 마스터했군! 자네의 강인한 다리는 이제 안전 지역을 확보하는 데 결정적인 역할을 할 걸세. 다음 목표는 더욱 위험한 구역의 정찰 임무다.",
      "good": "\"제자리 뛰기 훈련\"을 마치니, 숨이 턱까지 차오르지만 몸은 한결 가벼워진 기분입니다. 박 대장도 당신의 향상된 체력에 만족하는 눈치군요. 이제 더욱 안전하게 보급품을 찾아 나설 수 있겠습니다.",
      "normal": "\"자네의 긴급 도주 체력 훈련 덕분에 위기를 넘길 수 있었네. 박 대장도 자네의 성장을 눈여겨보고 있다네. 이제 다음 훈련을 통해 더욱 강해지게나.\""
    },
    "plank_hold": {
      "perfect": "더 이상의 좀비는 없다. 장시간 은폐 자세 유지 훈련을 완벽하게 수행한 당신 덕분에 놈들은 영원히 잊혀질 것이다. 이제 안전 지역을 확보하고 새로운 생존의 역사를 써내려 갈 시간이다.",
      "good": "훌륭하군! 자네의 플랭크 버티기 실력이 늘어난 덕분에 좀비 무리를 완벽하게 피할 수 있었어. 이제 박 대장과 함께 약속된 보급품을 챙겨 다음 은신처로 이동하도록 하지.",
      "normal": "\"훌륭하군! 자네의 은폐술 덕분에 좀비 무리를 따돌릴 수 있었어. 이제 박 대장에게 가서 생존 경험치를 받고 다음 임무를 준비하게나.\""
    }
  },
  "spy": {
    "squat": {
      "perfect": "불가능을 가능으로 만드는 당신, 역시 전설의 요원입니다. 잠입 작전 하체 강화를 완벽하게 수행한 당신에게 최고 기밀 접근 권한이 주어집니다. 이제, 다음 임무를 준비하십시오.",
      "good": "\"훌륭하군, 요원. '잠입 작전 하체 강화' 훈련을 성공적으로 마쳤습니다. 핸들러 오메가가 곧 신형 장비를 지급할 것이니, 다음 임무를 위해 만반의 준비를 갖추도록.\"",
      "normal": "\"신입, 이번 잠입 작전 하체 강화 훈련은 합격이다. 자네의 잠재력은 무궁무진하니, 앞으로 더 어려운 임무도 능히 해낼 수 있을 걸세. 훈련 점수가 상승했으니, 다음 훈련에서 더욱 발전된 모습을 기대하겠네.\""
    },
    "lunge": {
      "perfect": "전설의 요원이여, 은밀한 전진 훈련을 완벽하게 수행! 그림자처럼 움직이는 자네의 발걸음은 어떤 경비도 뚫을 수 있으리라. 최고 기밀 접근 권한이 주어질 것이다.",
      "good": "훌륭하군, 요원. 은밀한 전진 훈련 덕분에 자네의 잠입 능력이 향상되었어. 핸들러 오메가가 신형 위장 장비를 준비해 두었으니, 다음 임무를 기대하게.",
      "normal": "은밀한 전진 훈련을 마쳤군. 훈련 점수가 상승했으니, 다음 임무에서 더 날카로운 움직임을 보여주길 기대하겠네."
    },
    "bicep_curl": {
      "perfect": "전설의 요원이여, 클라이밍 팔 강화 훈련 완벽! 자네의 강인한 팔은 어떤 벽도 오를 수 있으리라. 최고 기밀 접근 권한이 활성화되었다.",
      "good": "훌륭하군, 요원. 클라이밍 팔 강화 훈련으로 자네의 팔 힘이 늘었어. 다음 잠입 작전에서 유용하게 쓰일 걸세. 핸들러 오메가가 기대하고 있다네.",
      "normal": "클라이밍 팔 강화 훈련을 마쳤군. 훈련 점수가 상승했으니, 더 어려운 임무에 도전할 준비를 하게."
    },
    "arm_raise": {
      "perfect": "전설의 요원이여, 천장 잠입 훈련을 완벽하게 수행! 높이 뻗은 그 팔로 어떤 환기구도 열 수 있으리라. 최고 기밀 접근 권한이 주어질 것이다.",
      "good": "훌륭하군, 요원. 천장 잠입 훈련 덕분에 자네의 어깨 가동성이 향상되었어. 다음 작전에서 활약을 기대하겠네.",
      "normal": "천장 잠입 훈련을 마쳤군. 훈련 점수가 상승했으니, 자네의 잠재력은 무궁무진해. 다음 임무를 기대하게."
    },
    "high_knees": {
      "perfect": "숨 가쁜 추격 대비 심폐 훈련을 완수한 당신, 역시 전설의 요원답군. 핸들러 오메가도 감탄을 금치 못하는군요. 이제 당신에게 최고 기밀 접근 권한이 주어질 겁니다.",
      "good": "\"훌륭해, 요원. 추격 대비 심폐 훈련을 성공적으로 마쳤군. 자네의 투지와 강인함이라면 다음 작전에서도 혁혁한 공을 세울 수 있을 거야. 핸들러 오메가가 자네에게 신형 장비를 지급할 예정이니 기대해도 좋을 걸세.\"",
      "normal": "\"훌륭하군, 요원. '추격 대비 심폐 훈련' 완수 덕분에 자네의 잠재력이 한층 더 개화했어. 핸들러 오메가가 자네의 훈련 점수 상승을 보고 기뻐할 걸세. 다음 임무에서 더 놀라운 활약을 기대하겠네.\""
    },
    "plank_hold": {
      "perfect": "\"플랭크 버티기 훈련 완수. 전설의 요원이여, 그대의 강인한 정신력과 육체는 어떠한 감시 임무도 완수할 수 있음을 증명했소. 이제 최고 기밀 접근 권한이 해제되었으니, 다음 임무에서 그대의 능력을 마음껏 발휘하시오.\"",
      "good": "\"훌륭하군, 요원. 장시간 감시 체력 훈련을 성공적으로 마쳤네. 자네의 인내와 집중력이라면 어떤 임무든 완수할 수 있을 걸세. 핸들러 오메가가 곧 신형 장비를 지급할 걸세. 다음 훈련에서 다시 보지.\"",
      "normal": "\"신입, 장시간 감시 체력 훈련 완수. 이제 자네도 어엿한 그림자 요원으로 거듭나는 건가. 다음 훈련에서 더 날카로운 모습을 기대하겠네.\""
    }
  }
}
